{
    "fixed-deposit-calculator": {
        "calculator_info": {
            "calculator_id": "8dd87cfe-e6b4-48f2-9486-00d879a2b847",
            "url": "fixed-deposit-calculator",
            "name": "Fixed Deposit Calculator",
            "description": "Boon or bane? FDs get a lot of flak, but there's probably a reason they're still around. Use this calculator to see if your FD is worth the money and time you're investing in it.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fixed-deposit-calculator/icon.webp",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fixed-deposit-calculator/icon.png",
            "related_calculators": []
        },
        "input_fields": [
            {
                "input_id": "df34546d-608d-4dc0-99e6-3c79d862f210",
                "type": "slider_and_input",
                "label": "Principal Amount",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>This is the principal amount, upon which your interest will be calculated</div>",
                "min_value": {
                    "label": "1K",
                    "value": 1000
                },
                "max_value": {
                    "label": "1CR",
                    "value": 10000000
                },
                "step_value": 1000,
                "value": 100000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "9c247148-af28-443e-9b9b-af295d393efb",
                "type": "slider_and_input",
                "label": "Interest Rate",
                "prefix_text": "",
                "suffix_text": "% p.a.",
                "more_info": "<div>This rate is decided by the bank or the company offering you the Fixed Deposit. This number can change based on the duration of your FD. Look for a number that matches your maturity period</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "20",
                    "value": 20
                },
                "step_value": 0.1,
                "value": "7.0",
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "7b5f63e9-3397-4be4-89f8-c13280d3182a",
                "type": "slider_and_input",
                "label": "Time Period",
                "prefix_text": "",
                "suffix_text": " months",
                "more_info": "<div>This is how long you're willing to keep aside your money to let it grow. Knowing how long you can keep it away will help you save on any penalties you may be charged for withdrawing early</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "120",
                    "value": 120
                },
                "step_value": 0,
                "value": 21,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "5d84a18b-3912-4f4d-8ff4-6208a9124d4a",
                "type": "dropdown",
                "label": "Compounding Frequency",
                "prefix_text": "",
                "suffix_text": "",
                "more_info": "<div>Compounding occurs when the interest you have earned gets added to your principal amount. The new interest is calculated based on this combined amount. Lower compounding frequencies work better for you. Check your bank's FD page for details.</div>",
                "min_value": null,
                "max_value": null,
                "step_value": 0,
                "value": {
                    "label": "Quarterly",
                    "value": 4,
                    "id": 3
                },
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [
                    {
                        "label": "Daily",
                        "value": 365,
                        "id": 1
                    },
                    {
                        "label": "Monthly",
                        "value": 12,
                        "id": 2
                    },
                    {
                        "label": "Quarterly",
                        "value": 4,
                        "id": 3
                    },
                    {
                        "label": "Half Yearly",
                        "value": 2,
                        "id": 4
                    },
                    {
                        "label": "Annually",
                        "value": 1,
                        "id": 5
                    }
                ]
            }
        ],
        "banner_details": {
            "title": "7.25% interest on FDs. That’s it. That’s the ad.",
            "title_color": "#ffffff",
            "button_text": "TRY FIXED DEPOSITS ON FI",
            "url": "https://fi-money-test.onelink.me/PxeA/1u5cifel",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Fixed-Deposits-desktop-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Fixed-Deposits-desktop-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Fixed-deposits-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Fixed-deposits-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>For a more detailed breakdown of how <a href='/blog/posts/what-is-an-fd' style='color: #00B899'>FDs</a> work, scroll down to the FAQ section. But in a nutshell, this calculator considers the same things that you would for any <a href='/blog/categories/investments' style='color: #00B899'>investment</a>, which are - money, time, and rate of growth (in this case, interest). It uses the compound interest formula to work out how much you will make from your investment at the end of the time period. The formula used here is A = P(1+r/n)nt<br /><br />Where:<br />A is the amount you get back at maturity<br />P is the principal amount you put into the FD<br />r is the rate of interest<br />n is the compounding frequency within a year<br />t is the time period of the FD</div>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What are fixed deposits?</div>",
                "content": "<div>Also known as the punching bag of the investment world. Everyone loves to hate fixed deposits, largely because they're such a dated way to grow your money.</div><br /><div>Here's how it came about - if you were looking to grow your money at a predictable rate, an FD was your best bet. You put in an amount of money for a fixed amount of time, and make a fixed amount of interest on it. The extra amount or interest you earn on it is taxed according to the <a href='/blog/posts/all-about-income-tax' style='color: #00B899'>income tax</a> slab that applies to you.</div><br /><div>Your money is locked in for the entire duration of your investment, so if you need that money, you'd have to pay a penalty for withdrawing it early. In short, it's what our parents used to invest in until the <a href='/blog/categories/us-stocks' style='color: #00B899'>stock</a> market came around. Fixated on trying out a Fixed Deposit? Try this calculator before you decide.</div>"
            },
            {
                "title": "<div>When do FDs help?</div>",
                "content": "<div>There are a bunch of things an FD can do for you. If you're someone who knows you're going to need some extra cash in some specific time, an FD gives you the kind of predictability you're looking for.</div><br /><div>Say, you're looking to travel abroad in a year's time and you've saved up the cash for the trip. With a Fixed Deposit, you know exactly how much your travel fund can grow to be in a year. You could also put that money into <a href='/features/mutual-funds' style='color: #00B899'>Mutual Funds</a> or into the stock market, but there you can't be sure of the returns.</div>"
            },
            {
                "title": "<div>What's not to like about FDs?</div>",
                "content": "<div>Predictability is also something that works against you here. You're only going to make that much extra money on a Fixed Deposit, which is in the range of 4-7%. Other investment options could potentially give you twice as much. The lock-in period means your money is out of reach, and that can be a bummer too.</div>"
            },
            {
                "title": "<div>What kind of tax saving can you get on FDs?</div>",
                "content": "<div>A tax-saving FD is different from a regular FD in that your money is locked away for 5 years. You can't take a loan using this FD as a collateral, and nor can you claim any tax deduction on the interest you earn from it.</div><br /><div>But here's the good part - you get an FD income tax exemption under section 80C, for a limit of ₹1,50,000. Here are some other things you might want to know:</div><ul style='padding: 0px 30px'><li>The interest you earn is taxable.</li><br /><li>This sort of FD does not auto-renew at the end of 5 years.</li><br /><li>You do have flexibility in terms of interest payouts (Quarterly, monthly, and so on)</li><br /><li>The interest rates for tax-saving FDs do not change throughout the 5-year period.</li></ul>"
            },
            {
                "title": "<div>What is a fixed deposit calculator?</div>",
                "content": "<div>The good ol' fixed deposit, a.ka., your parents favourite investment option. FDs are the gold standard for the Indian investor looking for safety of investment and predictability of returns. The concept is simple. You promise to keep a certain amount of money with the bank or any other deposit-taking financial institution for a fixed amount of time. In return, the bank gives you a fixed rate of interest on that amount. Now, FDs come in all shapes and sizes. You can invest crores or as little as ₹1000, depending on the bank. The period of an FD can range from anywhere between 7 days to 10 years. The interest can get compounded monthly, quarterly, half-yearly or annually. You can also choose to get the interest paid out to you at these frequencies rather than have it go back into the FD.  There are various penalties and charges for early withdrawal and some FDs are more flexible than others on such charges. But whatever type of FD you choose, they all have one thing in common. You will get back the money you've put in along with interest. The Fi Money fixed deposit calculator is an online tool that will show you the amount you can expect from an FD of your choice upon maturity.</div>"
            },
            {
                "title": "<div>How fixed deposit calculator can help you?</div>",
                "content": "<div>The humble FDs have been getting a bad rap lately for being a dated investment option. The lower rate of interest can result in negative real returns when inflation is running higher than FD rates. This means you can end up losing the value of your money instead of it appreciating over time.<br /><br /> Long-term FDs are also a losing bet when interest rates are rising since they can lock you in at a lower rate compared to the prevalent market conditions. But when it comes to safety, there's nothing like an FD to balance a high-risk portfolio. Or you just know that you're going to need a certain amount available to you after a couple of years like higher education, a trip abroad, marriage even.<br /><br /> FDs come in handy to ensure that you'll have that money at maturity. But calculating the interest you will earn and the total amount you will receive at maturity can be a tedious task. Or you may want to compare your FD returns with other investment options to aid you in making an important decision.<br /><br /> This is where an FD interest calculator can help. All you need to do is fill in a few details to see the returns you can expect in a couple of seconds.</div>"
            },
            {
                "title": "<div>What are the formula to determine the FD maturity amount?</div>",
                "content": "<div>Every fixed deposit has four basic components.<br />The principal amount, is the amount you put into the FD.<br />The tenure, is the period of time your money stays locked in the FD.<br />The rate of interest and the compounding frequency, which is the frequency with which the interest amount gets compounded into the principal amount.<br />These factors will together decide the amount you will get back when the FD matures. The formula used here goes like this:</div><br /><div>A = P(1+r/n)^nt</div><br /><div>Where,<br /><div>A is the amount you get back at maturity</div><div>P is the principal amount you put into the FD</div><div>r is the rate of interest</div><div>n is the compounding frequency within a year</div><div>t is the time period of the FD</div></div><br /><div>For example, if you put is ₹1,00,00 into an FD for 3 years with a 10% interest that gets compounded quarterly, the the amount you will get at maturity is calculated as such:</div><br /><div>A = 100000(1+0.1/4)^(4*3)</div><br /><div>A = ₹1,34,489</div>"
            },
            {
                "title": "<div>How to use this Fi Money fixed deposit calculator?</div>",
                "content": "<div>Using the Fi.Money Fixed Deposit calculator is as simple as it gets. Most FDs are simple enough when it comes to the variables involved but calculating the returns can get a bit tedious. To take care of all the hassles of calculation, here are a few details you need to fill in to allow this FD interest calculator to help you.</div><br /><ul style='padding: 0px 30px'><li>How much do you want to put into an FD? - This is what's called the principal amount upon which the interest rate will be calculated. You can invest anything from as little as  ₹1000 to crores in FDs, depending on the bank or financial institution.</li><br /><li>What is the interest rate this FD will give you? - Different types of FDs will give different rates of interest depending on a number of factors, one of which is the time period. The longer the FD period, the higher the interest and vice versa. FD rates are decided by banks and can vary from bank to bank for the same FD period.</li><br /><li>How long are you willing to not touch this money? - Many people see FD as a form of forced savings since you cannot use the money until maturity. Maybe you know exactly when you'll need the money in the future or maybe these are just funds you need to set aside for safety. But if you do find yourself in a situation where you have to 'break' the FD, it usually involves penalties and charges. Not to mention you lose out of the compounding effect of the interest.</li><br /><li>What's the compounding frequency of this FD? - This is the frequency with which the interest generated on your FD gets accrued into the principal amount. This is the process of compounding which ensures you get a higher interest amount in successive compounding cycles since your principal amount keeps on increasing. The frequency can be monthly, quarterly, half-yearly or annually.</li></ul>"
            },
            {
                "title": "<div>Benefits of using the Fi Money fixed deposit calculator</div>",
                "content": "<div>Despite all the criticism, FDs have been around for a long time, are still relevant today and are likely to stand the test of time in the future. Even though you can get twice the returns or more through equity mutual funds and other investment options, Indians just can't do without the safety and predictability of returns that FDs provide.<br /><br /> Besides, some FDs can save you tax as well. The amount you put in an FD is exempt from income tax as long as you maintain the FD for 5 years. However, the interest gained on this FD is taxable. FDs are a great option if you can plan your investments based on certain large expenditures in the future for which you will need the money to be completely safe.<br /><br /> These can be anything from education to purchasing a high-end gadget. And this is exactly the benefit the Fi Money fixed deposit calculator provides. It gives you visibility on the returns you can expect on your FDs minus the tedious calculations. It allows you to plan your investment or simply compare returns with other investment options.</div>"
            }
        ]
    },
    "rent-vs-buy-calculator": {
        "calculator_info": {
            "calculator_id": "8dd87cfe-e6b4-48f2-9486-00d879a2b848",
            "url": "rent-vs-buy-calculator",
            "name": "Rent vs Buy Calculator",
            "description": "What if you actually took your dad's advice and bought a flat? Bad buy? Visionary move? We'll know now once we've tried this calculator.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/rent-vs-buy-calculator/icon.png",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/rent-vs-buy-calculator/icon.png",
            "related_calculators": []
        },
        "input_fields": [
            {
                "name": "City to buy house",
                "input_id": "8ce49146-cb89-11ec-9d64-0242ac120002",
                "type": "dropdown_and_input",
                "label": "Which city do you live in?",
                "prefix_text": "",
                "suffix_text": "",
                "more_info": "<div>For looking up the Real Estate projections in your city</div>",
                "min_value": null,
                "max_value": null,
                "step_value": 0,
                "value": {
                    "id": 31,
                    "label": "Mumbai",
                    "value": { "city_return": "4.41", "city_std_dev": "1.45" }
                },
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": []
            },
            {
                "name": "House rent",
                "input_id": "96195fe4-cb89-11ec-9d64-0242ac120002",
                "type": "slider_and_input",
                "label": "Probable rent of the house you want to own?",
                "prefix_text": "₹",
                "suffix_text": " /mo",
                "more_info": "<div>This will be used to compare against the cost of buying</div>",
                "min_value": {
                    "label": "5,000",
                    "value": 5000
                },
                "max_value": {
                    "label": "5,00,000",
                    "value": 500000
                },
                "step_value": 1000,
                "value": 40000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "Rate at which rent increases",
                "input_id": "9b4ea97e-cb89-11ec-9d64-0242ac120002",
                "type": "slider_and_input",
                "label": "By how much will the rent go up annually",
                "prefix_text": "",
                "suffix_text": "% p.a",
                "more_info": "<div>Rent usually goes up by 5% in most cities</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "15",
                    "value": 15
                },
                "step_value": 0.1,
                "value": 5,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "Cost of house",
                "input_id": "a005c718-cb89-11ec-9d64-0242ac120002",
                "type": "slider_and_input",
                "label": "The cost of the house you want",
                "prefix_text": "₹",
                "suffix_text": " Cr",
                "more_info": "<div>You can look at property listings online if you don't know for sure</div>",
                "min_value": {
                    "label": "0.1",
                    "value": 0.1
                },
                "max_value": {
                    "label": "20",
                    "value": 20
                },
                "step_value": 0.1,
                "value": 2,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "Down payment of house",
                "input_id": "a88ca8b6-cb89-11ec-9d64-0242ac120002",
                "type": "slider_and_input",
                "label": "The down payment you can afford",
                "prefix_text": "",
                "suffix_text": " %",
                "more_info": "<div>Banks typically ask for at least 10% of the loan amount as Down Payment</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "100",
                    "value": 100
                },
                "step_value": 0.1,
                "value": 10,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "Loan interest",
                "input_id": "ae275b40-cb89-11ec-9d64-0242ac120002",
                "type": "slider_and_input",
                "label": "Housing loan interest rate",
                "prefix_text": "",
                "suffix_text": "% p.a.",
                "more_info": "<div>The lowest in the market is 6.5% right now</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "20",
                    "value": 20
                },
                "step_value": 0.1,
                "value": 7,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "Loan tenure",
                "input_id": "76de8071-c632-41d1-865d-b2bc9e3aa7a8",
                "type": "slider_and_input",
                "label": "Loan Tenure",
                "prefix_text": "",
                "suffix_text": " Years",
                "more_info": "<div>This helps you choose an EMI amount. Higher tenures have lower EMI amounts and vice versa</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "30",
                    "value": 30
                },
                "step_value": 0,
                "value": 20,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "Investment return rate",
                "input_id": "b369fa5e-cb89-11ec-9d64-0242ac120002",
                "type": "dropdown",
                "label": "How would you invest your savings if you choose to rent?",
                "prefix_text": "",
                "suffix_text": "",
                "more_info": "<div>We'll use this to calculate your opportunity cost. We invest your down payment + \"EMI - Rent\" i.e. the net additional amount you'd spend to purchase a house.<br /><br />Aggressively: 12% long term returns, you're comfortable with more risk<br /><br />Moderately: 9% long term returns, moderate risk<br /><br />Conservatively: 6% long term returns, very low risk</div>",
                "min_value": null,
                "max_value": null,
                "step_value": 0,
                "value": {
                    "label": "Moderately",
                    "value": 9,
                    "id": 2
                },
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [
                    {
                        "label": "Conservatively",
                        "value": 6,
                        "id": 1
                    },
                    {
                        "label": "Moderately",
                        "value": 9,
                        "id": 2
                    },
                    {
                        "label": "Aggressively",
                        "value": 12,
                        "id": 3
                    }
                ]
            },
            {
                "name": "House growth rate",
                "input_id": "ba441508-cb89-11ec-9d64-0242ac120002",
                "type": "slider",
                "label": "Your optimism levels about housing prices",
                "prefix_text": "",
                "suffix_text": "",
                "more_info": "<div>This input will compare against what we know of Real Estate price projections in your city</div>",
                "min_value": {
                    "label": "Highly Pessimistic",
                    "value": -20
                },
                "max_value": {
                    "label": "Highly Optimistic",
                    "value": 20
                },
                "step_value": 1,
                "value": 0,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null,
                "input_mapping": {
                    "-20": {
                        "label": "Highly Pessimistic"
                    },
                    "-19": {
                        "label": "Highly Pessimistic"
                    },
                    "-18": {
                        "label": "Highly Pessimistic"
                    },
                    "-17": {
                        "label": "Highly Pessimistic"
                    },
                    "-16": {
                        "label": "Highly Pessimistic"
                    },
                    "-15": {
                        "label": "Highly Pessimistic"
                    },
                    "-14": {
                        "label": "Highly Pessimistic"
                    },
                    "-13": {
                        "label": "Highly Pessimistic"
                    },
                    "-12": {
                        "label": "Highly Pessimistic"
                    },
                    "-11": {
                        "label": "Highly Pessimistic"
                    },
                    "-10": {
                        "label": "Pessimistic"
                    },
                    "-9": {
                        "label": "Pessimistic"
                    },
                    "-8": {
                        "label": "Pessimistic"
                    },
                    "-7": {
                        "label": "Pessimistic"
                    },
                    "-6": {
                        "label": "Pessimistic"
                    },
                    "-5": {
                        "label": "Pessimistic"
                    },
                    "-4": {
                        "label": "Pessimistic"
                    },
                    "-3": {
                        "label": "Pessimistic"
                    },
                    "-2": {
                        "label": "Pessimistic"
                    },
                    "-1": {
                        "label": "Pessimistic"
                    },
                    "0": {
                        "label": "Neutral"
                    },
                    "1": {
                        "label": "Optimistic"
                    },
                    "2": {
                        "label": "Optimistic"
                    },
                    "3": {
                        "label": "Optimistic"
                    },
                    "4": {
                        "label": "Optimistic"
                    },
                    "5": {
                        "label": "Optimistic"
                    },
                    "6": {
                        "label": "Optimistic"
                    },
                    "7": {
                        "label": "Optimistic"
                    },
                    "8": {
                        "label": "Optimistic"
                    },
                    "9": {
                        "label": "Optimistic"
                    },
                    "10": {
                        "label": "Optimistic"
                    },
                    "11": {
                        "label": "Highly Optimistic"
                    },
                    "12": {
                        "label": "Highly Optimistic"
                    },
                    "13": {
                        "label": "Highly Optimistic"
                    },
                    "14": {
                        "label": "Highly Optimistic"
                    },
                    "15": {
                        "label": "Highly Optimistic"
                    },
                    "16": {
                        "label": "Highly Optimistic"
                    },
                    "17": {
                        "label": "Highly Optimistic"
                    },
                    "18": {
                        "label": "Highly Optimistic"
                    },
                    "19": {
                        "label": "Highly Optimistic"
                    },
                    "20": {
                        "label": "Highly Optimistic"
                    }
                }
            }
        ],
        "banner_details": {
            "title": "The best way to pay rent is here",
            "title_color": "#ffffff",
            "button_text": "AUTO-PAY WITH FI",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Rent-vs-buy-desktop-banner-updated.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Rent-vs-buy-desktop-banner-updated.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Rent-vs-buy-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Rent-vs-buy-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>You will be able to find a more detailed breakdown of the methodology used in this calculator below. But here's a shorter explanation:</div><br /><div>At the outset, note that while deciding to become a homeowner you should be able to afford the monthly <a href='/blog/posts/how-to-calculate-home-loan-emi' style='color: #00B899'>EMIs.</a> If you aren't in a position to park aside these large amounts, you may be better off with a less expensive house that won't burn such a hole in your pocket each month. Alternatively, increase your loan tenure.</div><br /><div>This calculator compares the two scenarios - owning or renting the same house.</div><br /><div>Owning a house:</div><ul style='padding: 0px 30px'><li>You put in a down payment, take a <a href='/blog/posts/personal-loan-vs-home-loan-which-is-better' style='color: #00B899'>loan</a> and own the house immediately.</li><li>You save on rent and your house appreciates over time</li><li>At some point, when the rent amount hypothetically exceeds your loan EMI, we also invest the difference till your loan matures.</li></ul><br /><div>Renting the same house:</div><ul style='padding: 0px 30px'><li>Your estimated down payment amount is invested in a market-linked instrument like mutual funds</li><li>You also invest the difference between your EMI and monthly rent. This difference is a diminishing amount over your loan tenure, because your rent will increase every year.</li></ul><br /><div>At the end of this period, we compare both of these decisions and see which one is more beneficial to you.</div>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What is a rent vs buy calculator?</div>",
                "content": "<div>To rent or to buy, isn't an easy question to answer and this is an online calculator that knows that. There are a wide range of moving parts when it comes to deciding to rent or to buy a house.</div><br /><div><b>Key factors:</b></div><div>Owning a house is a major decision and involves a considerable <a href='/blog/categories/investments' style='color: #00B899'>investment</a> of time and effort apart from money. Renting is a relatively less intimidating decision since you can always pack up and move out. But one thing that is common to both is location, location, and location. This has implications on many other factors like the price tag the house comes with or the rent. If you want to buy a house, this will also affect the loan you may need to take to finance the decision and the repayment terms. Additionally, there will be repair and maintenance costs along with other fees and charges like stamp duty and property tax to consider. None of these additional costs should matter to you if you've decided to go with renting out a place.</div><br /><div><b>Decision making:</b></div><div>Another factor that is highly dependent on location is how much the value of the property will appreciate over the years. Since buying a house involves a sizeable amount of investment over renting, in the short term at least, it's important to consider how the property value appreciates compared with had you decided to invest the money in other financial instruments. The amount of time you plan on staying in the house will play a big role when it comes to renting. It is assumed you will stay or hold the property for the long term if you buy a house. But if you're paying rent, there will come a point in time when you end up paying more than the cost of the house if you stay long enough. Taking factors like these into account, the Fi Money rent vs buy calculator can help you compare the financial implications of each option so that deciding whether to rent or buy a house becomes that much easier for you.</div>"
            },
            {
                "title": "<div>How to use the Fi Money rent vs buy calculator?</div>",
                "content": "<div>Deciding to rent versus buying a house is by no means a simple task. From financials to future plans to logistics, there's certainly a lot to consider. Luckily, the Fi Money rent vs buy calculator is here to help with one of those things. Here's a couple of things you'll need to put down so that this online calculator can do its work.</div><br /><ul style='padding: 0px 30px'><li>Which city do you live in? - This will help us look up the real estate price projections in your city of choice. The projected value of houses is based on <a style='color: #00B899' href='https://residex.nhbonline.org.in/' target='_blank'>the RBI survey</a> conducted across Indian cities.</li><br /><li>What is the probable rent of the house you want to own? - You can look up property sites or apps to figure this out. It will be used to make a comparison against the cost of buying the house.</li><br /><li>By how much will your rent go up annually? - Just like prices, rent goes up too. Rent is usually hiked by 5% on an annual basis.</li><br /><li>What is the cost of the house you want? - You can check property listings online to fill out this one. And there's no need to panic at the number of zeroes.</li><br /><li>What is the down payment you can afford? - This is important since it will determine terms of a potential home loan and consequently how buying that house compares to renting. Banks typically ask for 10% of the loan amount as a down payment.</li><br /><li>Housing loan interest rate - This will depend on a number of factors from your credit score to market conditions, but in general, it is lower than other types of loans. Banks decide the interest rate on loans but you can put in your best guess.</li><br /><li>What's your loan tenure? - Home loans comparatively have a longer tenure to ease the repayment burden. This will decide your EMI amount. Higher the tenure, lower the EMIs and vice versa.</li><br /><li>How do you normally invest? - Are you all about that high-risk-high-return game? Do you like to balance the risk across your investment portfolio? Or do you prefer to keep your money safe? Why are we asking this? If you invest in buying a house, the difference between your home loan EMIs versus your monthly rent could have been invested in other financial instruments. This is the opportunity cost of buying a house which is another factor this online calculator uses to make as accurate a comparison as possible.</li><br /><li>What is your optimism level about housing prices? - One factor in your decision to buy a house could be that you're optimistic of the prices going up in the future. An indication of your optimism levels will be compared against what we know of property price projections in your city.</li></ul><br /><div>The Fi Money rent vs buy calculator will take away the tediousness of comparing all these factors against one another and give you an idea of when it is better to rent and when it is better to buy that house.</div>"
            },
            {
                "title": "<div>What is the methodology used in the Fi Money rent vs buy calculator?</div>",
                "content": "<div>Few of us can truly factor in every aspect involved in that question to come up with a definitive answer. But we have the next best thing, the Fi Money <a href='/blog/posts/is-it-better-to-rent-or-buy' style='color: #00B899'>rent vs buy </a>calculator.</div><br /><div><b>Key factors:</b></div><div>True to its name, this online calculator can help simplify the calculations when it comes to deciding the financial aspects of renting versus buying a house. Just like the actual decision of whether to rent or buy, this calculator considers a range of inputs to come up with an estimate that will give you a better picture of renting versus buying a house.</div><br /><div>It takes into account everything from the property value projections of the city you want to live in to the cost of renting to your potential home loan EMIs and the opportunity cost of using the money for investments in other financial instruments. All this to help you decide whether you're financially better off renting or buying that house. And even though that might seem like quite a comprehensive list, there are factors we have left out (and with good reason).</div><br /><div>This online calculator does not take into consideration inflation since it will impact both options equally and hence cancels each other out. Another factor we simply cannot estimate and compare is the emotional value in deciding to own a home. But rest assured, the Fi Money rent vs buy calculator is your best tool in helping you make this crucial decision.</div>"
            },
            {
                "title": "<div>Why use this rent vs buy calculator?</div>",
                "content": "<div>Buying a house is a major decision and a milestone for many. But you might want to compare it with renting to see which decision leaves you better off. Now, there are a whole bunch of things you might have on your mind when weighing the pros and cons of each option.</div><br /><div>For instance, renting will give you the flexibility to move around and not be tied to a place while also being the more cost effective option, in the short term. But buying a house could be a dream you always wanted to achieve and you're just not sure if your current financial situation stacks in your favour.</div><br /><div>The point is, it's a complex decision process that involves a lot of moving parts and you could probably use any and all the help you can get. One major part of this process is the financial aspect of the decision and that's where the Fi Money rent vs buy calculator comes in. By taking into consideration a comprehensive set of factors impacting both buying and renting a house, this online calculator will save you loads of tedious calculations, time and effort and give you a better picture of whether you are financially better off buying or renting that house.</div>"
            }
        ]
    },
    "mutual-fund-goal-calculator": {
        "calculator_info": {
            "calculator_id": "f2e7f4ce-151c-4dd9-9fd9-78ba6f7b3602",
            "url": "mutual-fund-goal-calculator",
            "name": "Mutual Fund Goal Calculator",
            "description": "Gunning for a big goal? Investing in Mutual Funds can help you get there. Use this calculator to see how much you need to invest.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/mutual-fund-goal-calculator/icon.png",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/mutual-fund-goal-calculator/icon.png",
            "related_calculators": []
        },
        "input_fields": [
            {
                "input_id": "a5c35d1a-7348-47e1-88a3-f781e2140d5b",
                "type": "slider_and_input",
                "label": "Investment goal amount",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>The total amount you wish to have at the end of your investment duration</div>",
                "min_value": {
                    "label": "1K",
                    "value": 1000
                },
                "max_value": {
                    "label": "10CR",
                    "value": 100000000
                },
                "step_value": 1000,
                "value": 1000000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "ffe05630-2a9b-4fc9-bc9f-370d4309d817",
                "type": "dropdown",
                "label": "Investing frequency",
                "prefix_text": "",
                "suffix_text": "",
                "more_info": "<div>The frequency at which you want to invest</div>",
                "min_value": null,
                "max_value": null,
                "step_value": 0,
                "value": {
                    "label": "Monthly",
                    "value": 12,
                    "id": 3
                },
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [
                    {
                        "label": "Daily",
                        "value": 365,
                        "id": 1
                    },
                    {
                        "label": "Weekly",
                        "value": 52,
                        "id": 2
                    },
                    {
                        "label": "Monthly",
                        "value": 12,
                        "id": 3
                    },
                    {
                        "label": "Quarterly",
                        "value": 4,
                        "id": 4
                    }
                ]
            },
            {
                "input_id": "73345335-d5e2-48c1-8aa2-1f7001106964",
                "type": "slider_and_input",
                "label": "Investment duration",
                "prefix_text": "",
                "suffix_text": " years",
                "more_info": "<div>Total time horizon that you want to stay invested for</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "30",
                    "value": 30
                },
                "step_value": 0.1,
                "value": "5",
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "39d25d47-b961-4df4-ad1c-a94787454a64",
                "type": "slider_and_input",
                "label": "Expected return",
                "prefix_text": "",
                "suffix_text": "% p.a",
                "more_info": "<div>Depending on the category and risk profile, different mutual funds provide various levels of returns. Choose an average rate.</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "20",
                    "value": 20
                },
                "step_value": 0.1,
                "value": 9,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            }
        ],
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>This calculator considers the goal amount you're chasing, and tells you how much to invest, based on how long you have to achieve your goal.</div><br /><div>It breaks up your goal amount into smaller periodic amounts using your expected returns as an acceleration factor. A great way to ensure you are investing regularly is to use FIT Rules on the Fi app. Fit Rules can automate your <a style='color: #00B899' href='/blog/categories/investments'>investments</a> so that the Rules are triggered at pre-decided frequencies (like daily, weekly, etc) or based on your habits (like investing a fixed amount each time you shop online).</div>"
            }
        ],
        "banner_details": {
            "title": "Your portfolio 🤝🏻 900+ mutual funds",
            "title_color": "#ffffff",
            "button_text": "INVEST NOW",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Mutual-funds-desktop-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Mutual-funds-desktop-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Mututal-funds-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Mututal-funds-mobile-banner.png"
            }
        },
        "faqs_information": [
            {
                "title": "<div>What is mutual funds goal calculator?</div>",
                "content": "<div>Investing can be a daunting task full of big decisions. Where to invest? How to invest? What level of risk should I take? But you can make the process easier by taking it one step at a time. Systematic Investment Plans or SIPs are a way to invest fixed amounts in mutual funds regularly over a period of time.<br /><br />They are a great way not only to start investing but to stay invested for a while. It builds a healthy habit of saving and brings discipline to your investments. If you're here, then it's likely that you've already ticked one decision off the list and are going with SIPs. The next thing you're probably thinking about is how much you should be investing with each SIP. And that's exactly what an SIP goal calculator is all about. Like all things in finance, there are many ways to approach this decision.<br /><br />One approach is to go bottom-up by considering an <a href='/blog/posts/what-are-sips-and-how-to-start-an-sip-investment' style='color: #00B899'>SIP</a> figure and visualising the amount you'll end up with after a certain amount of time. Another is a top-down approach where you consider the total amount you want after a period of time and break that down into a manageable fixed SIP amount. The Fi.Money SIP goal calculator is an online tool that takes the latter approach to simplify SIP investing, one step at a time.</div>"
            },
            {
                "title": "<div>How does the mutual funds goal calculator help you?</div>",
                "content": "<div>Everyone has a number. By that we mean the amount of money you'd like to have after a certain period of time. The figure could represent the amount of wealth you want to own by a certain age, a retirement fund you'd be comfortable with, education or a holiday.<br /><br />Whatever the case may be, we all have a goal when it comes to our finances. No doubt this will be a substantial figure and it might seem like you're far from achieving it. But worry not, the Fi.Money <a href='/calculators/mutual-fund-goal-calculator' style='color: #00B899; word-break: break-word'>Mutual Fund Goal Calculator</a> is here to help. Investing through SIPs is a great way to achieve your goals with regular fixed mutual fund contributions.<br /><br />But there are a couple of other things to consider like the amount of time and money required and the returns and frequency of investments it will take to get there. All you need to do is think of a number and this calculator will tell you how to get there.<br /><br />In the process, it will help you visualise the answers to some important questions when deciding to invest like what's your investment goal, how long should you keep investing, what kind of returns should you expect on your investments and at what frequency should you be investing.</div>"
            },
            {
                "title": "<div>How to use this Fi Money mutual funds goal calculator?</div>",
                "content": "<div>The Fi.MoneyMutual Fund Calculator  takes a target approach to help you achieve your financial goals. There are four questions you need to answer and in return, this online calculator will answer the all-important question - How much should you invest in SIPs.</div><br /><ul style='padding: 0px 30px'><li>What's your investment goal amount? - One point that should guide you while answering this question is what are you investing for. Ultimately everyone invests to build wealth but it's important to know what you are building that wealth for.  Education? Vacation? A house? <a href='/blog/posts/all-about-retirement-schemes-in-india' style='color: #00B899'>Retirement</a> fund? All of the above?</li><br /><li>How long will you be investing? - Apart from your investment goal and its purpose, you should consider at what stage you are in life while answering this question. It's usually a good idea to take a long-term horizon to take advantage of the benefits of compounding and tax breaks.</li><br /><li>What's your investment frequency? - One of the best aspects of investing through SIPs is that you can choose a frequency you're comfortable with. Apart from the usual monthly SIPs, Fi's AutoInvest feature offers weekly and even daily investment frequencies. This helps in averaging out market fluctuations and protects your investments from volatility.</li><br /></ul><br /><div>Here are the past returns from a range of mutual funds:</div><br /><style>.fund-categories-section {display: flex; flex-direction: column; justify-content: space-between; width: 268px; margin: 0px auto;} @media (min-width: 768px){.fund-categories-section {flex-direction: row; width: unset;}} .fund-categories-image-one {width: 268px;} @media (min-width: 768px){.fund-categories-image-one {width: 311px;}} @media (min-width: 1290px){.fund-categories-image-one {width: 466px;}} .fund-categories-image-two {width: 268px; margin-top: 18px;} @media (min-width: 768px){.fund-categories-image-two {width: 312px; margin-top: unset;}} @media (min-width: 1290px){.fund-categories-image-two {width: 462px;}}</style><div class='fund-categories-section'><div class='fund-categories-image-one'><img style='width: 100%' src='https://epifi-icons.s3.ap-south-1.amazonaws.com/web/assets/svgs/different-mutual-fund-returns-2.svg' /></div><div class='fund-categories-image-two'><img style='width: 100%' src='https://epifi-icons.s3.ap-south-1.amazonaws.com/web/assets/svgs/different-mutual-fund-returns-1.svg' /></div></div><br /><ul style='padding: 0px 30px'><li>What is your expected <a href='/blog/posts/what-is-roi-how-to-calculate-return-on-investment' style='color: #00B899'>return on investments?</a> - While we all expect to make very high returns on our investments, it's good to have reasonable expectations in general and to use this calculator effectively to get realistic answers. Depending on the category and risk profile, different mutual funds provide various levels of returns.</li></ul>"
            },
            {
                "title": "<div>How much should I invest in SIPs every month?</div>",
                "content": "<div>There's no hard and fast rule to SIPs. Sure, there's the 50-30-20 rule that says you should keep 50% of your monthly income for essentials, 30% for entertainment and the remaining 20% for investing.<br /><br /> But these are just guardrails, each of us have our own unique financial realities to consider. Some may not be able to invest 20% every month because they're paying off a loan. Others might be able to invest more than 20% because they're staying at home. Whatever your situation is, you should arrive at an SIP figure that you are comfortable with because while it's important to think of the future, there are needs and wants that have to be taken care of in the present.<br /><br /> So, how much should you invest in SIPs monthly? Let your financial goals and expectations guide you while taking into consideration your current income and lifestyle needs. Now, if all this seems a little vague and complicated, just use the Fi.MoneyMutual Fund Calculator  to help you simplify and visualise these as tangible numbers you can take action upon.</div>"
            },
            {
                "title": "<div>What is the minimum amount to invest in SIPs?</div>",
                "content": "<div>One of the great features of SIPs is its ability to bring the benefits of investing in financial markets to anyone, irrespective of their level of income. You can start investing in mutual funds through SIPs with as little as ₹100. With Fi, you can set up AutoInvest rules with a monthly, weekly and even daily frequency, depending on what you're comfortable with. At the other end of the spectrum, there is no upper limit on the amount of money you can invest through SIPs.</div>"
            }
        ]
    },
    "mutual-fund-sip-calculator": {
        "calculator_info": {
            "calculator_id": "f20e449c-753a-4bdb-ab12-58eaddf862ce",
            "url": "mutual-fund-sip-calculator",
            "name": "Mutual Fund SIP Calculator",
            "description": "Invest today for a better tomorrow? If that's not motivating enough, maybe seeing how your SIPs shape up over the years might help. Use this calculator to see how much your SIP installments today could give you at maturity.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/mutual-fund-sip-calculator/icon.png",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/mutual-fund-goal-calculator/icon.png",
            "related_calculators": []
        },
        "input_fields": [
            {
                "input_id": "4c2fedff-4569-4fc0-843f-a713b6ced8b9",
                "type": "slider_and_input",
                "label": "SIP amount",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>Choose an amount that you're currently investing or an amount you're comfortable with investing</div>",
                "min_value": {
                    "label": "1K",
                    "value": 1000
                },
                "max_value": {
                    "label": "5L",
                    "value": 500000
                },
                "step_value": 1000,
                "value": 5000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "83e3a886-2665-4b24-86f0-3cf68f042ad4",
                "type": "dropdown",
                "label": "SIP frequency",
                "prefix_text": "",
                "suffix_text": "",
                "more_info": "<div>Choose a frequency for your SIP installments</div>",
                "min_value": null,
                "max_value": null,
                "step_value": 0,
                "value": {
                    "label": "Monthly",
                    "value": 12,
                    "id": 3
                },
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [
                    {
                        "label": "Daily",
                        "value": 365,
                        "id": 1
                    },
                    {
                        "label": "Weekly",
                        "value": 52,
                        "id": 2
                    },
                    {
                        "label": "Monthly",
                        "value": 12,
                        "id": 3
                    },
                    {
                        "label": "Quarterly",
                        "value": 4,
                        "id": 4
                    }
                ]
            },
            {
                "input_id": "7dfe1504-fbb4-4950-9cad-3b0404d5012d",
                "type": "slider_and_input",
                "label": "Annual SIP increment",
                "prefix_text": "",
                "suffix_text": "% p.a.",
                "more_info": "<div>Ideally, you should increase your SIP investments each year by at least 5% to keep up with inflation</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "10",
                    "value": 10
                },
                "step_value": 0.1,
                "value": "5",
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "f5dd5349-3b18-4750-b3f3-1f124ca2bdc6",
                "type": "slider_and_input",
                "label": "Investment duration",
                "prefix_text": "",
                "suffix_text": " years",
                "more_info": "<div>Total time horizon that you want to stay invested for</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "30",
                    "value": 30
                },
                "step_value": 0.1,
                "value": "5",
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "8a2c93b0-5b4e-4395-b30f-e57d61456213",
                "type": "slider_and_input",
                "label": "Expected return",
                "prefix_text": "",
                "suffix_text": "% p.a",
                "more_info": "<div>Depending on the category and risk profile, different mutual funds provide various levels of returns. Choose an average rate</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "20",
                    "value": 20
                },
                "step_value": 0.1,
                "value": 9,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            }
        ],
        "banner_details": {
            "title": "Hydrate your portfolio with small SIPs",
            "title_color": "#ffffff",
            "button_text": "INVEST WITH FI",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/SIPs-desktop-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/SIPs-desktop-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/SIPs-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/SIPs-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>The 3 main factors that affect your final <a href='/blog/categories/investments' style='color: #00B899'>investment</a> value are your investment frequency, investment amount, and the rate of return. This calculator takes into account these 3 factors to give you a picture of your investment at the end of the chosen time period.</div><br /><div>Among the greatest benefits of investing through <a href='/blog/posts/what-are-sips-and-how-to-start-an-sip-investment' style='color: #00B899'>SIPs</a> is Rupee Cost Averaging. It involves investing small amounts of money over many installments as against investing the entire amount at once. This method of investing can help you get a lower purchase price over a period of time, as you are buying at different price points.</div><br /><div>A great way to ensure you are investing regularly is to use FIT Rules on the Fi app. FIT Rules can automate your <a href='/blog/categories/investments' style='color: #00B899'>investments</a> so that the Rules are triggered at pre-decided frequencies (like daily, weekly, etc) or based on your habits (like investing a fixed amount each time you shop online).</div>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What is a mutual funds SIP calculator?</div>",
                "content": "<div>If you're reading this, then you've probably already decided to invest in <a href='/features/mutual-funds' style='color: #00B899'>mutual funds</a>, which is a great decision. They are a convenient way to get access and benefit from financial markets and build your wealth.<br /><br />The next decision you must make is how you will invest your money in mutual funds. At this stage, every investor is presented with one of two options - SIP or lump sum. SIP stands for Systematic Investment Plan. It's a great way to start investing and to ensure you're investing a fixed amount regularly. Your money is automatically invested from your savings bank account so you build a healthy saving and investment habit without having to think about it.<br /><br />SIPs also allow you to take advantage of favourable market movements while ironing out volatility. But sometimes it can get hard to see your end goal when it's so far away. The Fi Money Mutual Funds SIP calculator is an online tool that can show you what you and your SIPs are working towards.</div>"
            },
            {
                "title": "<div>SIPs vs Lumpsums. What's the difference?</div>",
                "content": "<div>SIP stands for Systematic Investment Plan. It's a way for you to ensure you're investing regularly, and your money is automatically invested from your savings bank account.<br /><br />Lumpsums on the other hand, are defined as larger investments that you can make as one-offs. Since there's no set frequency, you might feel the need to time the market right for larger amounts. This can be a tricky task that's rarely effective.</div>"
            },
            {
                "title": "<div>How does this `mutual funds SIP calculator` help you?</div>",
                "content": "<div>There are many things to consider when it comes to investing in mutual funds through SIPs. While a high level of market volatility is a well-known stressor for any investor, SIPs tend to average out market volatility.<br /><br /> So, when it comes to the entire duration of investment, you need not be too worried about short-term market movements. On the other hand, you need to have a certain amount of liquidity regularly available to make SIP payments. This might not be such a problem for salaried professionals, but can be an issue if your liquidity depends on business income or profits.<br /><br /> But frequency is just one part of it. Your returns will also depend on how much you're ready to set aside for investing, by how much you can regularly increase this figure, your expectations and  how long you plan on investing. The Fi Money mutual funds SIP calculator can help you visualise your returns by taking all these factors into account.</div>"
            },
            {
                "title": "<div>How to use this Fi Money mutual funds SIP calculator?</div>",
                "content": "<div>While we fret about regularly setting aside money for SIPs, it's important to remind yourself what you're working towards. The Fi Money Mutual Funds SIP calculator visualise your returns at the end of the SIP duration. All you have to do is answer these questions.</div><br /><ul style='padding: 0px 30px'><li>What's your SIP amount? - This decision should be based on your financial goals and your current income. Choose an amount that you would be comfortable putting aside on a regular basis while having enough money to spend on things here and now.</li><br /><li>What's the frequency of your SIP payments? - The frequency of your SIP payments should be in line with your liquidity. It means that you should set a frequency based on how steady your sources of income are. Fi offers great flexibility for mutual fund investments with monthly, weekly and even daily AutoInvest rules.</li><br /><li>How much will you increase your SIPs every year? - Whether you are salaried or self-employed, it's most likely that your income will keep increasing as the years go by and so should your investments. Ideally, you should increase your SIP investments each year by at least 5% to keep up with inflation.</li><br /><li>What is your expected return on investments? - Everyone wants to maximise their returns, it's the name of the investing game. When it comes to financial planning, it's best to consider reasonable figures to get realistic estimates. Depending on the category and risk profile, different mutual funds provide various levels of returns.</li></ul><br /><div>Here are the past returns from a range of mutual funds:</div><br /><style>.fund-categories-section {display: flex; flex-direction: column; justify-content: space-between; width: 268px; margin: 0px auto;} @media (min-width: 768px){.fund-categories-section {flex-direction: row; width: unset;}} .fund-categories-image-one {width: 268px;} @media (min-width: 768px){.fund-categories-image-one {width: 311px;}} @media (min-width: 1290px){.fund-categories-image-one {width: 466px;}} .fund-categories-image-two {width: 268px; margin-top: 18px;} @media (min-width: 768px){.fund-categories-image-two {width: 312px; margin-top: unset;}} @media (min-width: 1290px){.fund-categories-image-two {width: 462px;}}</style><div class='fund-categories-section'><div class='fund-categories-image-one'><img style='width: 100%' src='https://epifi-icons.s3.ap-south-1.amazonaws.com/web/assets/svgs/different-mutual-fund-returns-2.svg' /></div><div class='fund-categories-image-two'><img style='width: 100%' src='https://epifi-icons.s3.ap-south-1.amazonaws.com/web/assets/svgs/different-mutual-fund-returns-1.svg' /></div></div><br /><ul style='padding: 0px 30px'><li>How long will you be investing? - One of the few things that are simple about investing is that when it comes to time, the longer the better. That being said, your time horizon depends on your unique financial situation and goals.</li></ul><br /><div>Taking all these into consideration, this calculator will give you the return you can expect through SIPs at the end of your investment duration.</div>"
            },
            {
                "title": "<div>Benefits of using the Fi Money mutual funds SIP calculator?</div>",
                "content": "<div>Within the choice between SIPs and lump sum investing lies another choice and that is the frequency of SIP installments. SIPs are most commonly paid on a monthly basis but with Fi's AutoInvest rules, you can invest in mutual funds weekly and even daily.<br /><br /> The advantage with more frequency is the ability to capitalise on sudden and sharp market movements while ironing out volatility at the same time. This is not an option for lump sum investments. The Fi Money Mutual Funds SIP calculator gives you the benefit of foresight with an estimate of the returns on your SIPs, allowing you to make a more informed decision. But here's some food for thought, you can always supplement your SIPs with lump sums when the market moves in your favour.</div>"
            },
            {
                "title": "<div>SIP or Lumpsums: which among these two give better returns?</div>",
                "content": "<div>When choosing between SIPs or lump sum mutual fund investments, market conditions are an important factor to consider. In a declining market, SIPs perform better since you can purchase more units of a mutual fund with each SIP installment.<br /><br /> A lump sum investment locks you into a mutual fund at a higher price in such a situation. On the other hand, a lump sum investment can buy you more units of a mutual fund compared to SIPs when the market is on the climb. You also have the added flexibility to increase your SIP installments over time, an option which doesn't exist for lump sum investing. Additionally, your returns also depend on the time of your exit when you withdraw the funds. Ultimately, your returns will depend on a combination of all these factors and there's nothing to say that one will give more returns than the other. Choosing between the two all depends on the financial condition you find yourself in and your goals.</div>"
            }
        ]
    },
    "ppf-calculator": {
        "calculator_info": {
            "calculator_id": "717da899-bb00-4246-b17a-c1723d9dd5f9",
            "url": "ppf-calculator",
            "name": "PPF Calculator",
            "description": "The Public Provident Fund is a great bet for your tax savings, as well as your financial stability. Or is it? Try this calculator to see for yourself.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/ppf-calculator/icon.png",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/calculators/icons/ppf-calculator/icon.png",
            "related_calculators": []
        },
        "input_fields": [
            {
                "input_id": "5919d287-b8f8-4278-863b-21cbe018fd6d",
                "type": "slider_and_input",
                "label": "Annual investment amount",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>You can invest anywhere between ₹500 to ₹1.5 lakh per year in PPF</div>",
                "min_value": {
                    "label": "500",
                    "value": 500
                },
                "max_value": {
                    "label": "1.5L",
                    "value": 150000
                },
                "step_value": 500,
                "value": 50000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "5d9bb7b0-533c-4441-8444-8c91c9c2fe76",
                "type": "slider_and_input",
                "label": "Investment duration",
                "prefix_text": "",
                "suffix_text": " years",
                "more_info": "<div>The min. Investment duration for PPF is 15 years which can be extended in blocks of 5 years. Choose a duration you're comfortable with.</div>",
                "min_value": {
                    "label": "15",
                    "value": 15
                },
                "max_value": {
                    "label": "50",
                    "value": 50
                },
                "step_value": 0.1,
                "value": 15,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "5eddf416-af4c-4c80-a2ca-5d61051f1598",
                "type": "input",
                "label": "Rate of interest",
                "prefix_text": "",
                "suffix_text": "%",
                "more_info": "<div>This field is fixed since the interest rate on PPF is decided by the government</div>",
                "min_value": {
                    "label": "",
                    "value": 7.1
                },
                "max_value": {
                    "label": "",
                    "value": 7.1
                },
                "step_value": 0,
                "value": 7.1,
                "readable_only": true,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            }
        ],
        "banner_details": {
            "title": "Save your taxes for another day",
            "title_color": "#000000",
            "button_text": "Invest in ELSS funds",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/PPF-desktop-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/PPF-desktop-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/PPFs-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/PPFs-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>Scroll over to the FAQ section understand all about PPFs. In short, this <a href='/blog/posts/how-to-invest-in-public-provident-fund' style='color: #00B899'>PPF</a> calculator works like any compound interest calculator by using this formula:</div><div>A = P[({(1+r)n}-1)/r]</div><br /><div>Where:</div><div>A is the amount you get back at maturity<br />P is the annual installment you put into your PPF<br />r is the rate of interest<br />n is the number of periods of <a href='/blog/categories/investments' style='color: #00B899'>investment</a><br /></div><br /><div>The rate of interest assumed is 7.1%. However, this amount changes every year.You can invest any amount you like in a PPF, but you're only eligible for ₹1.5 lakh annual deduction from your taxable income. Once you start investing in a PPF, you need to put in a minimum of ₹500 to stay invested."
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What is meant by a PPF calculator?</div>",
                "content": "<div>The PPF or Public Provident Fund is a government-backed investment option that has a lot going for it. The government backing is the first major advantage since not only is the amount you put in completely safe, the returns are guaranteed. The interest rate is decided by the government on a quarterly basis, which means it is not subject to market fluctuations.<br /><br /> The rate of interest is also typically in the 7-8% range, putting it ahead of fixed deposits and short-duration debt <a href='/features/mutual-funds' style='color: #00B899; word-break: break-word'>mutual funds.</a> All this makes the PPF a great risk-free option if you're looking for a safe bet, which is why it's been one of the most popular investment instruments for Indians over the 50 years of its existence. And we haven't even got to taxation yet.<br /><br /> The PPF falls under the 'EEE' category of tax exemptions, which is the gold standard for a tax-efficient investment option. It stands for Exempt-Exempt-Exempt which means the money you put in is exempted from tax, the interest you earn while staying invested is exempted from tax and the amount you withdraw at the end of your investment duration is also tax-exempt. If you're reading about PPF for the first time, you're probably wondering why no one told you about this scheme sooner. But wait, there's more.<br /><br /> You can start investing in PPF with as little as ₹500 a year and you can even take a loan against your PPF balance. So what's not to like? Well for one, the PPF comes with a minimum 15-year lock-in period and only partial withdrawals are permitted after 5 years. A lot of things can happen in 15 years for which you may need the money. Also, this investment option comes with an upper limit of ₹1.5 lakh per year.<br /><br /> Now, with all these pros and cons, you probably want to know what your returns will look like over the years if you put your money into the PPF and that's exactly what the Fi Money PPF calculator is all about.</div>"
            },
            {
                "title": "<div>How can I calculate my PPF amount?</div>",
                "content": "<div>Calculating the returns on your PPF investments (or potential investments) is simply a question of compound interest. Here are a couple of things you need to know before you get your pen and paper out.<br /><br /> You'll have to decide on the monthly or annual amount you're going to invest in the PPF. This can range from ₹500 to ₹1.5 lakh per year. The next thing is the duration of your investment. The minimum duration for this option is 15 years which can be extended by 5 years at a time. If you've already put in money into the PPF, then you'll have to consider how much time you have left from when you opened the account till 15 years or till when you want to hold on to it.<br /><br /> The next thing you need is the applicable rate of interest. The government sets the PPF interest rate on a quarterly basis and it gets compounded on an annual basis. But why spend your precious time on all this when you can just use the Fi Money PPF calculator to get the job done in a matter of seconds.</div>"
            },
            {
                "title": "<div>How does this PPF calculator work?</div>",
                "content": "<div>We get it, calculations aren't always fun. So, let us handle the maths for you. All you need is to answer a few questions to see what you can get out of investing in PPF.</div><br /><ul style='padding: 0px 30px'><li>What is your monthly investment amount? - The PPF is one of the few investment options that have both a lower and an upper annual limit on investments along with a cap on the number of investments per year. Within a year, you can invest anywhere between ₹500 to ₹1.5 lakh. This can be done in a maximum of 12 instalments per year. That means if you plan to invest each month, you can invest a maximum of ₹12,500 per month.</li><br /><li>What's your investment duration? - Here too, the PPF differs from other investment options with its looooong lock-in period of 15 years. That means you can only withdraw all your funds from the PPF after 15 years of opening an account. Thereafter, you can extend the duration of your PPF investments in blocks of 5 years, i.e. 20, 25, 30 and so on.</li><br /><li>What's your current PPF balance? - If you've already invested in PPF then you don't need to hear the pros and cons from us. Just enter your existing balance to help the <a href='/calculators' style='color: #00B899'>calculator</a> work out your returns.</li><br /><li>Rate of interest - Notice the lack of a question mark here. That's because the government decides the rate of interest your PPF investments will get on a quarterly basis. This usually ranges between 7-8% and gets compounded annually. This calculator reflects the current PPF interest rate.</li><br /></ul><div>Taking all of this into account, the Fi Money PPF calculator will tell you the total amount you've invested, the interest you've gained and the total amount available to you at the end of your investment duration.</div>"
            },
            {
                "title": "<div>Benefits of using the Fi Money PPF calculator</div>",
                "content": "<div>The PPF has remained one of India's most popular investment options for a long time and with good reason too. The long list of pros makes it quite an effective investment avenue for the risk-averse investor or for the safe part of your portfolio.<br /><br /> Guaranteed, government-backed, non-stock market dependent, largely inflation-beating and higher-than-<a href='/blog/posts/what-is-an-fd' style='color: #00B899'>FD</a> returns are just some of the reasons behind India's affinity for the PPF. Not to mention the triple tax advantage it comes with.<br /><br /> Your investment amount, the interest on investment and the total amount at maturity are tax-exempt. But before you open your PPF account, which can be done in a matter of minutes at any bank or post office, here's the catch. All the money you put into it isn't going anywhere for the next 15 years from when you open an account, i.e. a lifetime of a lock-in period. Besides, there's a cap on how much you can invest in the PPF, set at ₹1.5 lakh per year, and the number of instalments per year at 12.<br /><br /> Now, weighing all of this against each other and other investment options can be a difficult task. One way to go about it is to let the numbers speak for themselves. The Fi Money PPF calculator is an online tool that will help understand what your returns could look like at the end of your investment duration.</div>"
            },
            {
                "title": "<div>How can a PPF calculator help you?</div>",
                "content": "<div>A PPF has a lot going for it. It's a great investment tool, if you're looking for a predictable way to stay on top of inflation over the years. But it also comes at a cost - your money is locked away for 15 years before you can actually get your hands on it.</div><br /><div>This calculator is one way to know if the time and investment is worth it. 15 years is a lifetime, after all. Interest rate aside, you make up to ₹1,50,000 of your income exempt from <a href='/blog/posts/all-about-income-tax' style='color: #00B899'>tax</a> each year.</div>"
            },
            {
                "title": "<div>Advantages of having a PPF</div>",
                "content": "<div>For one, the PPF has been around for over 50 years now, and doesn't look like it will be irrelevant anytime soon. But you can never be too sure so here are some facts:</div><br /><div>A majority of investors who rely on the Public Provident Fund as an investment option do so for its predictable nature of returns. Your returns are risk-free - this means it's not subject to whatever state the stock market is in.</div><br /><div>You can open a PPF account in minutes from any of the major banks, and claim ₹1,50,000 of it as tax savings. Also, you could invest as little as ₹500 to begin with, and ₹1.5 lakh each year to keep the investment going over 15 years.</div>"
            }
        ]
    },
    "personal-loan-emi-calculator": {
        "calculator_info": {
            "calculator_id": "385b15ce-5ae0-48a6-871b-4f6b67dfd122",
            "url": "personal-loan-emi-calculator",
            "name": "Personal Loan EMI Calculator ",
            "description": "No-cost, low-cost, monthly, yearly, there are EMIs of all kinds. Use this calculator to work out what your EMI payments will look like. Plan them, pay them, stay debt-free.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/personal-loan-emi-calculator/icon.png",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/personal-loan-emi-calculator/icon.png",
            "related_calculators": []
        },
        "input_fields": [
            {
                "input_id": "77fc5eac-c1e8-49e1-ad68-5ee48aff13a7",
                "type": "slider_and_input",
                "label": "Your loan amount",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>Your total loan amount excluding any downpayment you've made</div>",
                "min_value": {
                    "label": "50000",
                    "value": 50000
                },
                "max_value": {
                    "label": "10CR",
                    "value": 100000000
                },
                "step_value": 1000,
                "value": 100000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "f2e34743-f13e-4e5e-9978-3721881006c1",
                "type": "slider_and_input",
                "label": "Loan tenure",
                "prefix_text": "",
                "suffix_text": " years",
                "more_info": "<div>How long do you have to repay this loan?</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "30",
                    "value": 30
                },
                "step_value": 1,
                "value": 5,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "bea51e58-30dc-44b8-90b5-347c6152553c",
                "type": "slider_and_input",
                "label": "Interest on loan taken",
                "prefix_text": "",
                "suffix_text": "%",
                "more_info": "<div>The interest rate taken on the home loan</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "20",
                    "value": 20
                },
                "step_value": 0.1,
                "value": 10,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            }
        ],
        "banner_details": {
            "title": "Money in the bank ⚡ ️in minutes",
            "title_color": "#ffffff",
            "button_text": "Apply for a personal loan",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/EMI-desktop-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/EMI-desktop-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/EMIs-mobile-banner-updated.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/EMIs-mobile-banner-updated.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>For a detailed breakdown into how EMIs work, scroll over to the FAQ section on this page. In a nutshell, your this <a href='/blog/posts/calculating-the-emi-on-your-personal-loan' style='color: #00B899'>EMI</a> calculator takes into account just 3 things - your loan amount, the duration for which the loan has been taken, and the interest rate you're required to pay on this loan.</div><br /><div>An EMI or an 'Equated Monthly Installment' is essentially your loan payment broken down into installments. It's taking money on rent from a lender. Each EMI payment combines the principal amount with the interest amount. At the start of your EMI payments, a major chunk of your EMI amount is just the interest you owe the bank.</div><br /><div>The interesting thing about this? As you keep paying off your EMIs, the interest component keeps reducing. And after a point, you're only paying off the principal. This happens because your principal amount keeps decreasing with each repayment.</div><br /><div>This is the formula used:</div><div>EMI = P × r × (1 + r)n/((1 + r)n - 1) where P= Loan amount, r= interest rate, n=tenure in number of months.</div><br /><div>Note that - there's also a chance that your EMI amounts change if the bank or lender revises their interest rates.</div>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What are personal loans?</div>",
                "content": "<div><a href='/blog/posts/how-to-calculate-personal-loan-repayments' style='color: #00B899'>Personal loans</a>, as opposed to business or commercial loans, are loans that banks or other lending institutions provide to individuals. The money from personal loans can be used for a variety of reasons, which is not the case for specific loans such as a home loan, car loan or education loan.</div><br /><div>Personal loans are also different from credit lines in the way money is lent. A personal loan is disbursed by a lender in the form of a lump sum amount that is typically deposited directly into your bank account. On the other hand, credit lines such as a credit card, represent a continuously open line of credit that can be used on a recurring basis, usually in smaller amounts than a personal loan.</div><br /><div>Furthermore, there are two types of personal loans - secured loans and <a href='/blog/posts/what-is-an-unsecured-personal-loan-how-to-get-one' style='color: #00B899'>unsecured loans</a>. A secured loan is backed by an asset such as your house or car which is given as <a href='/blog/posts/how-to-get-a-small-personal-loan-without-collateral' style='color: #00B899'>collateral</a>. In case you default on your loan repayment, the lender can take possession of this asset to recover its dues.</div><br /><div>Unsecured loans, as the name suggests, are not backed by any collateral. Unsecured loans usually come with a higher rate of interest since they are considered riskier for a lender. Also, it might be harder for you to get an unsecured loan if you don't have a credit history or you don't have a strong credit score.</div>"
            },
            {
                "title": "<div>Why use personal loans?</div>",
                "content": "<div>Since personal loans are not tied to any specific use or purchase, they can be used for a number of reasons. These can include any large expenditure that you may need to undertake but don't currently have the cash for. Maybe your house is in dire need of repairs or renovation. If you're planning on getting married soon, there might be no getting away from that big, fat (and costly) Indian wedding.</div><br /><div>Personal loans also come in handy in the unfortunate event that you need to cover a large medical bill for which you are either uninsured or underinsured. If you've been waiting for too long for that foreign trip and have been unable to save up, a personal loan can help you with that well-deserved break.</div><br /><div>Another reason people may take a personal loan is to consolidate their debt. If you have a number of debts to keep up such as multiple <a href='/blog/posts/how-to-pay-your-credit-card-bill-different-methods-explained' style='color: #00B899'>credit card bills</a> or other forms of credit, they each have their own EMI cycles and varying interest charges and it can be easy to lose track. To bring all these different debts, EMIs and interest charges under one loan and a single monthly payment, you can consolidate it under a personal loan.</div>"
            },
            {
                "title": "<div>How to calculate a personal loan?</div>",
                "content": "<div>Different types of loans have a different set of considerations, yet all loans have three basic factors that interact in different ways with each other to decide how you will repay the loan.</div><br /><div>First is the loan amount that you are seeking to borrow. This has a very straightforward relation with the loan period and the repayment amount. A higher loan amount will take longer to repay and result in a higher EMI amount and vice versa.</div><br /><div>The second is the loan period. The longer the loan period the lower will be your EMI amount. Also, the longer the loan period, the higher will be the interest amount you pay on the loan.</div><br /><div>The third factor is the rate of interest. The interest rate on a personal loan is usually higher when compared to other types of loans like home loans, car loans or education loans.</div><br /><div>It also depends on a range of factors such as your credit score and whether it is a secured or unsecured loan. Unsecured loans which do not have any collateral assets backing them have a higher rate of interest. Together, these three factors decide the total amount you have to repay the lender and the EMI amount. Use the Fi Money personal loan EMI calculator to handle these calculations for you so that you can make a more informed decision when it comes to applying for a personal loan.</div>"
            },
            {
                "title": "<div>Components of the personal loan EMI calculator</div>",
                "content": "<div>Personal loans come in all shapes and sizes but they will all have three basic components - the amount, rate of interest and loan period. Some of these components are in your control while others are decided by the bank or lending institution. The Fi Money personal loan EMI calculator allows you to see how each of these components interact with each other and how that might affect your EMIs. Let's see what these components are.</div><br /><ul style='padding: 0px 30px'><li>Loan amount - This is the first thing you should consider when planning to take out any loan, be it personal or otherwise. It is one of the components that are in your control and the other two components are highly dependent on this factor. The higher the amount, the longer it will take you to repay the loan and vice versa.</li><br /><li>Loan period - This is the number of years you will repay the loan and it is another one of the components that you can control. The longer the loan period, the lower will be your personal loan EMI and vice versa. But one important point to remember is that at the same rate of interest, a longer loan period will result in a higher interest amount.</li><br /><li>Rate of interest - This is the part of the loan that is not in your control since the lender decides this. It depends on a number of factors like whether you have a credit history, your credit score and whether it's a secured or unsecured loan. Even small changes in the interest rate can have a big impact on your personal loan EMI and total repayable amount.</li></ul><br /><div>Once you decide on these three components, the Fi Money personal loan EMI calculator will show you what your EMI amount will be based on this information along with the interest amount, the total amount to be repaid and a loan repayment schedule.</div>"
            },
            {
                "title": "<div>How is the personal loan EMI to be paid?</div>",
                "content": "<div>When you take a loan from a bank or any lending institution, you agree to repay the borrowed amount along with interest. The total amount repayable is split into equated monthly instalments (EMIs) to be paid over a fixed period of time.<br /><br /> When these details are fixed, the lender will provide you with an amortisation schedule. If you didn't get that, there's no reason to panic. Amortisation is a financial term that simply refers to the process of repaying a debt. The schedule will show you all your EMIs through the entire loan term and indicate how much of the loan has been paid off and how much is left with each EMI. It will also show you what part of the total amount you are paying off - interest and borrowed amount.<br /><br /> Typically, you start off by paying more of the interest amount and move on to clear the borrowed amount by the end of the loan duration. It is important to make sure you have the capacity to pay your EMIs regularly. If you happen to miss an EMI, it gets reported to credit bureaus that maintain your credit score, which will have a negative impact on your credit score.<br /><br /> One rule of thumb is to make sure your monthly EMIs do not go over 50% of your monthly income. This can be done easily with a little bit of planning and the use of online calculators like the Fi Money personal loan EMI calculator.</div>"
            }
        ]
    },
    "nps-calculator": {
        "calculator_info": {
            "calculator_id": "8149630e-72a2-44de-aa80-8d20299aa49c",
            "url": "nps-calculator",
            "name": "NPS Calculator",
            "description": "Love saving taxes, who doesn't? And while you're at it, how about throwing in some retirement planning as well? If that awoke your inner financial planner, then this NPS calculator is for you.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/nps-calculator/icon.png",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/nps-calculator/icon.png",
            "related_calculators": []
        },
        "input_fields": [
            {
                "input_id": "089d8db7-dc93-4476-93ce-e172cd4df28a",
                "type": "slider_and_input",
                "label": "Age",
                "prefix_text": "",
                "suffix_text": " years",
                "more_info": "<div>It's never too early to start thinking about retirement. Enter your age in years here",
                "min_value": {
                    "label": "18",
                    "value": 18
                },
                "max_value": {
                    "label": "60",
                    "value": 60
                },
                "step_value": 1,
                "value": 25,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "1b765631-6a11-4f22-bd42-a63d43aaec0a",
                "type": "slider_and_input",
                "label": "Monthly investment",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>You can invest a min of ₹500 per contribution and a min of ₹1000 per financial year. You're required to invest till you're 60.</div>",
                "min_value": {
                    "label": "500",
                    "value": 500
                },
                "max_value": {
                    "label": "150000",
                    "value": 150000
                },
                "step_value": 500,
                "value": 5000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "56aedcb8-0fed-4ffa-8f98-8e071fe59fb1",
                "type": "slider_and_input",
                "label": "Expected return",
                "prefix_text": "",
                "suffix_text": "% p.a",
                "more_info": "<div>NPS offers multiple investment options with returns ranging between 5% to 20%</div>",
                "min_value": {
                    "label": "5",
                    "value": 5
                },
                "max_value": {
                    "label": "20",
                    "value": 20
                },
                "step_value": 0.1,
                "value": 9,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "input_id": "5ee3f77c-394d-44f3-b124-ceb7c8e961da",
                "type": "slider_and_input",
                "label": "Expected annuity return",
                "prefix_text": "",
                "suffix_text": "% p.a",
                "more_info": "<div>This is the expected interest rate you will earn on your annuity. Typically, annuities have an interest rate similar to FD rates (between 5 - 8%)</div>",
                "min_value": {
                    "label": "2",
                    "value": 2
                },
                "max_value": {
                    "label": "10",
                    "value": 10
                },
                "step_value": 0.1,
                "value": 6,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            }
        ],
        "banner_details": {
            "title": "Retire at 40 like a boss ",
            "title_color": "#000000",
            "button_text": "Grow your wealth with Fi",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/NPS-desktop-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/NPS-desktop-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/NPS-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/NPS-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>This calculator is the most comprehensive <a href='/blog/posts/how-to-open-nps-account-online' style='color: #00B899'>NPS</a> calculator you'll ever see. It considers a couple of factors like your age, investment capacity and your return expectations to give you clarity on the two most important goals for any NPS investor. Your potential annual tax savings and your monthly pension post <a href='/blog/posts/all-about-retirement-schemes-in-india' style='color: #00B899'>retirement</a>, adjusted for inflation.</div>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What is an NPS calculator?</div>",
                "content": "<div>The National Pension System or NPS is part of the government's efforts at creating a social security net for Indians post retirement. Not to mention, a great <a href='/blog/posts/best-tax-saving-investment-option-in-india' style='color: #00B899'>tax saving investment option</a> as well. The NPS was established in 2004 and in many ways is an improvement over the other retirement fund options available.</div><br /><div>For one thing, it allows investors a degree of control over the way their money is invested. You can choose the level of risk you want to take on in terms of asset allocation between equity and debt investments. Or you can use the Auto choice option which lets the good folks at the NPS Trust decide for you. And the way they do that is based on your age. The idea is to allocate your investments based on your lifecycle. The younger you are the more risk-taking capacity you have and as you age, your <a href='/blog/categories/investments' style='color: #00B899; word-break: break-word'>investments</a> are allocated more towards safer assets like government securities. And since the NPS is to a certain extent market-linked, returns can range anywhere between 5% to 20%.</div><br /><div>Besides these, there are a bunch of factors to consider if you're thinking of opening an NPS account. For instance, it's a long term investment, and we mean looooooog term. Your money is essentially locked in until you turn 60. Although, tax-free withdrawals up to 25% of your total investment are allowed after a 3-year lock-in period. This is based on specific conditions like critical illness, skill development or a new business venture. And you won't get your entire retirement corpus then since you have to invest at least 40% of the amount in an annuity. Annuity is the amount paid out to you every year, for the rest of your life after the NPS has matured.<br /><br />It ensures that while you get a lump sum amount, the rest will be given to you in monthly installments for the remainder of your retirement. This annuity investment again will give you returns depending on the prevailing interest rates in the future. And let's not forget to account for inflation, which will have a profound impact on such a long term investment.</div><br /><div>The Fi Money NPS calculator is an online tool that can cut through all the clutter to give an idea of what you can expect when you exit the NPS all those years later.</div>"
            },
            {
                "title": "<div>How does NPS withdrawal work?</div>",
                "content": "<div>NPS investments are meant for retirement, therefore they cannot be withdrawn freely, PFRDA lays down certain guidelines when withdrawal is allowed.<br /><br /><ol style='padding: 0px 30px'><li>When a subscriber reaches the age of 60 years, he or she can withdraw from the NPS scheme. However as the name suggests `National Pension Scheme`, an investor will need to subscribe to a pension with at least 40% of accumulated <a href='/blog/posts/how-to-withdraw-your-pension-contribution-in-epf' style='color: #00B899'>pension</a> corpus. This can be done by purchasing an annuity that would provide a regular monthly pension for the user. The remaining funds can be withdrawn as a lump sum.</li><li>If the total accumulated pension corpus is less than or equal to Rs. 5 lakh, Subscriber can opt for 100% lump sum withdrawal. No annuity purchase will be required in this case.</li><li>In case of premature exit (exit before attaining the age of 60 years) from NPS, at least 80% of the accumulated pension corpus of the investor has to be utilised for purchase of an annuity that would provide a regular monthly pension. The remaining 20% can be withdrawn as a lump sum. Even for a premature exit, you need to complete at least 5 years of investment in the NPS scheme.</li></ol><br />Typically it is more efficient to limit the annuity purchase to 40% of the total corpus as one can earn a higher rate of return from senior citizen FDs and other safe investment products.</div>"
            },
            {
                "title": "<div>What is an annuity?</div>",
                "content": "<div>Annuity refers to the monthly sum received by the NPS investor from an Annuity Service Provider (ASP). A percentage of the pension wealth as decided by the Subscribers (minimum 40% & 80% in case of premature exit) is utilised for purchase of annuity from various Annuity Service Providers.<br /><br />Annuities can be purchased by paying an upfront amount, in return the annuity guarantees a fixed rate of return for a certain time period (typically, rest of your life span).</div>"
            },
            {
                "title": "<div>Who can use the Fi Money NPS calculator?</div>",
                "content": "<div>If you're looking for the technical answer, then any Indian resident between the age of 18 and 60 years can open an NPS account online or offline, subject to compliance with KYC guidelines. And with that out of the way, your parents will tell you it's never too early to start thinking about retirement. And while that might be true, there's another major attraction that draws people to the NPS.<br /><br /> Two words, tax saving. NPS account holders can save up to ₹1.5 lakh per year on taxable income under the section 80C exemptions. Not just that, you can take advantage of an additional ₹50,000 tax deduction per year under section 80CCB over and above the usual 80C exemption.<br /><br />The point here is, your age does not matter and neither does your purpose. Whether you're considering the NPS as a retirement fund, to save taxes or just to see what this thing is all about, the Fi Money NPS calculator will definitely be of use to you.</div>"
            },
            {
                "title": "<div>What are the features of this Fi Money NPS calculator?</div>",
                "content": "<div>It is important to understand the nuances of any investment option you might be considering since after all, it's your hard-earned money that you're putting into it. The NPS is a great option, in case you're thinking about it, and one with many factors to consider. And one way to understand how these factors might affect you and your money is to use the Fi Money NPS calculator.<br /><br />The first thing you should be thinking about is quite simply, your age. Once you start investing in the NPS, apart from some minor exceptions, you won't be able to access that money until you turn 60, i.e, retirement.<br /><br />Next, you'll want to think about how much you're ready to set aside monthly for such a long term investment. The minimum investment is ₹500 per contribution along with a minimum annual investment of ₹1000.<br /><br />Another very important factor you should give some thought to is the kind of returns you're expecting from the NPS. You can choose the degree of risk you're willing to take or you can set your NPS account to Auto choice. This indicates the type of asset allocation your money will be invested in and consequently the kind of returns you can expect.<br /><br />Similarly, you will have to set your expectations of returns from your annuity investment. That's because when you exit the NPS, you must invest a minimum of 40% of your total retirement corpus in annuities while you can keep the rest as a lump sum return.<br /><br />Based on these inputs, the Fi.Money NPS calculator can tell you the indicative profits you've gained, your total NPS contributions, the lump sum amount you can get along with the amount you would have to put into annuities. It will also tell you the monthly pension you could receive from the annuity investment and its present value adjusted for inflation. And finally, the yearly tax amount you may save.</div>"
            },
            {
                "title": "<div>How to use the Fi Money NPS calculator?</div>",
                "content": "<div>Calculating your potential returns from NPS can be quite a tedious task. For starters, it's one of the few investment options where you have to compulsorily invest a (substantial) part of your returns in another instrument at maturity. And don't forget to account for the impact of inflation over the investment period. So, why not get rid of the maths and use the Fi Money NPS calculator online to get the job done? Here's an example for more clarity.<br /><br />Meghna is a 25-year old analyst who's thinking of opening an NPS account. She's heard about the great tax savings and the long term benefits. But first, she needs to see some cold hard numbers to make an informed decision, as any of us would. So, naturally, she turns to the Fi Money NPS calculator.<br /><br />Now, here's some things Meghna already knows. She's ready to put down about ₹5000 every month in NPS. She's done her research and expects an average of 12% returns from this investment. She knows that she'll have to put at least 40% of her retirement corpus into annuities and expects a 6% return from there.<br /><br />And once she ran the numbers, she was quite impressed with the comprehensive results she got. This is what it looked like.<br /><br />At the age of 60, Meghna would have made a total investment of ₹15 lakh towards NPS. On this, she would earn profits of ₹3.1 crore. Her total retirement corpus would amount to ₹3.24 crore. The amount she can withdraw as lump sum upon exiting NPS would be ₹1.94 crore. And the remaining  ₹1.3 crore would have to go towards annuities. Her monthly pension from the annuity investment would be ₹64,953, but adjusting for inflation, that would amount to ₹8,451 in present day value. And she would have saved ₹19,800 annually in income tax.<br /><br />With this newfound clarity, Meghna decided that she would go ahead and open an NPS account and use this online NPS calculator to make adjustments in her investment strategy along the way.</div>"
            },
            {
                "title": "<div>How does the Fi Money NPS calculator work?</div>",
                "content": "<div>The Fi Money NPS calculator works in mysterious ways. Just kidding, it's based on cold, hard maths. The NPS uses compound interest to calculate your gains and so does this calculator. Don't believe us? Take a look at the Fi Money NPS calculator formula for yourself.<br /><br />One thing to note before we get to the formula. NPS returns are market-linked, which differentiates it from other retirement savings instruments that pay out a defined interest. That is why this online calculator asks for your expected return based on the NPS scheme you are likely to choose.<br /><br />Also, we assume that you would be investing a part of your salary every month and so, your investments are compounded at a monthly frequency. Now, back to the formula.<br /><br />A = P(1 + r/n)^nt<br /><br />Where,<br /><br /><div>A is your total retirement corpus<br />P is your total NPS contribution<br />r is the annual rate of interest  on your contributions<br />n is the number of times the interest gets compounded<br />t is the total duration of investment, which is the number of years till you turn 60<br /><br />Annual tax savings - ₹19,800</div></div>"
            }
        ]
    },
    "hra-calculator": {
        "calculator_info": {
            "calculator_id": "30f08198-8639-449a-a5f0-fb7eca9bb046",
            "url": "hra-calculator",
            "name": "HRA Calculator",
            "description": "HRA is the part of the fixed component of your salary that is meant for covering your rent expenses. Not all of this amount is tax-free. Use this calculator to work out how much tax you can save.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/hra-calculator/icon.png",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/hra-calculator/icon.png",
            "related_calculators": []
        },
        "input_fields": [
            {
                "name": "annual salary component",
                "input_id": "86ca687b-1056-43d5-8119-e197257e0c13",
                "type": "input",
                "label": "Annual salary basic component",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>This is usually about 40-50% of your total salary, for the exact amount, check your latest salary slip",
                "min_value": null,
                "max_value": null,
                "step_value": 1,
                "value": 600000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "hra salary component",
                "input_id": "a347e4b5-5d51-46b2-a040-ba5614ec97c0",
                "type": "input",
                "label": "HRA component of salary",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>Your salary slip will show this as a separate component. This is how much you are paid to cover your rent expenses",
                "min_value": null,
                "max_value": null,
                "step_value": 1,
                "value": 200000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "rent paid annually",
                "input_id": "22293588-a009-4354-9b9f-644eace6f373",
                "type": "input",
                "label": "Total rent paid by you annually",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>Your monthly rent over 12 months. Not including your maintenance",
                "min_value": null,
                "max_value": null,
                "step_value": 1,
                "value": 180000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "current city",
                "input_id": "441f9b13-ca94-4b13-9e57-93d2227daa0a",
                "type": "dropdown",
                "label": "Which city do you live in?",
                "prefix_text": "",
                "suffix_text": "",
                "more_info": "<div>Tax exemption rates vary according to city</div>",
                "min_value": null,
                "max_value": null,
                "step_value": 0,
                "value": {
                    "label": "Mumbai",
                    "value": "Yes",
                    "id": 1
                },
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [
                    {
                        "label": "Mumbai",
                        "value": true,
                        "id": 1
                    },
                    {
                        "label": "Delhi",
                        "value": true,
                        "id": 2
                    },
                    {
                        "label": "Kolkata",
                        "value": true,
                        "id": 3
                    },
                    {
                        "label": "Chennai",
                        "value": true,
                        "id": 4
                    },
                    {
                        "label": "Other City",
                        "value": false,
                        "id": 5
                    }
                ]
            }
        ],
        "banner_details": {
            "title": "Tax saver funds are here to save the day",
            "title_color": "#ffffff",
            "button_text": "Invest in ELSS funds",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/HRA-desktop-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/HRA-desktop-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/HRA-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/HRA-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>HRA or House Rent Allowance, is a part of your salary that's given to you by your employer to cover your rent if you live in rented accommodation. This amount is tax-exempt in most cases, especially if you're living in a metro city like Mumbai, Delhi, etc.<br /><br />The purpose of this <a href='/calculators' style='color: #00B899'>calculator</a> is to help you work out whether the amount of rent you're paying is more than whatever is tax-exempt or not.<br /><br />Depending on which city you live in, the amount of your HRA that is tax-exempt will vary. To use this calculator, you'll need your latest salary slip, because that's where you'll be able to find the exact details of your basic salary and the HRA component of your salary.<br /><br />This calculator needs the following information to give you some actionable insight:<br /><ol style='padding: 0px 50px'><li>The basic component of your <a href='/blog/posts/how-to-calculate-annual-salary' style='color: #00B899'>annual income</a></li><li>The HRA that you're getting from your employer</li><li>Your annual rent minus 10% of your salary's basic component (this is calculated based on your inputs)</li><li>And whether or not you live in a metro city</li></ol><br />The lowest of the above values is what you'll be tax-exempt for. Let's say your monthly basic salary is ₹50,000 and the monthly HRA that your company gives you is ₹21,000. And let's say you live in Bangalore, where you're paying ₹28,000 as monthly rent.<br /><ol style='padding: 0px 50px'><li>This means your basic annual income is - ₹6,00,000</li><li>The HRA given to you annually is - ₹2,52,000</li><li>The annual rent you're paying minus 10% of your annual basic would work out to - ₹3,31,000</li><li>And since you're hypothetically living in Bengaluru, it's 50% of your basic, which is - ₹3,00,000</li></ol><br />In this hypothetical scenario, the lowest of these 4 is the second one which is your employer-given HRA. This amount is tax-exempt. The additional ₹84,000 of rent money paid by you is not tax-exempt. This should put things in perspective.</div>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>Understanding HRA</div>",
                "content": "<div><a href='/blog/posts/how-to-claim-hra-and-home-loan-tax-exemptions' style='color: #00B899'>HRA</a> refers to the Housing Rent Allowance. If you're a salaried employee who lives in a rented house, then guess what? You can claim for HRA. Depending on several factors like your income, city of residence, etc. You'd probably see this in your salary slip as well. The amount of HRA you receive is decided by your organization. A few institutions can be an exception to HRA and may not provide HRA to their employees. However, on a wider ground, every salaried employee has access to HRA. It is primarily a component of your salary and is taxable under Section 10(13A) of <a href='/blog/posts/all-about-income-tax' style='color: #00B899'>Income Tax</a>.</div>"
            },
            {
                "title": "<div>What is an HRA Calculator?</div>",
                "content": "<div>HRA calculator is one digital tool that any individual can use to calculate the amount of tax that will be charged on your HRA by the government. The calculator is quite simple and easy to use. All you have to do is enter a few details, such as your basic salary, DA that you receive, HRA, the total rent you pay, city of residence, etc. Once you enter these details and click on submit, the HRA exemption calculator will show the result instantly.</div>"
            },
            {
                "title": "<div>What benefits do you enjoy with HRA Calculator?</div>",
                "content": "<div>Why do you need to use the HRA calculator, and how does it benefit you? The very basic benefits you enjoy are-<br /><br /><ul style='padding: 0px 30px'><li><b>Skip the calculations</b><br />With a digital tool like the HRA calculator online, you do not have to stress your brain over calculations. The basic purpose of the HRA calculator is to cut on the manual calculation just like a regular calculator. So, enter details and stay relaxed.</li><br /><li><b>Save Time and Effort</b><br />The time you may invest in calculating HRA, and the effort you put in is relatively much more than that of an HRA calculator online. Picking up the pen and paper and calculating results can be time taking. So save your time and effort with a digital calculator.</li><br /><li><b>Under Your Comfort Zone</b><br />Mobile phones and laptops have become a part of daily life. So, you do not have to go anywhere when it is about HRA calculation for income tax.</li><br /><li><b>Accurate Result</b><br />Being a digital tool, the HRA calculator is designed in a way to provide an accurate result. Based on your input, the results will be as close to the real number as possible.</li></ul></div>"
            },
            {
                "title": "<div>What affects your HRA?</div>",
                "content": "<div>The institution you are working at considers a few things while deciding on the HRA. Check out on what basis HRA is calculated. It will also help you find out how to calculate HRA in your salary that you receive.<br /><br /><ul style='padding: 0px 30px'><li><b>City of Residence</b><br />Not every city has similar rent rates. Hence, depending on the city you are residing in, you get the HRA. For metro cities, you get an amount equal to 50% of your basic salary; for non-metro cities, the cap is 40%.</li><br /><li><b>Basic Salary</b><br />Depending on an individual's salary, the amount of the HRA received obviously varies. The higher your salary, the higher will be the HRA. You can use the HRA calculator to find out your HRA accordingly.</li></ul></div>"
            },
            {
                "title": "<div>What is the process of claiming an HRA tax deduction?</div>",
                "content": "<div>One essential thing to acknowledge is you are eligible to receive tax benefits if you receive HRA. The amount of rent you pay to the landlord or house owner is liable to be taxed, and you are also eligible to claim tax deductions under Section 10(13A) of the Income Tax. Let's see how to do the HRA calculation for Income Tax.<br /><br /><ul style='padding: 0px 30px'><li>There are three conditions that the income tax takes into consideration while deciding your tax benefit for HRA.</li><ol type='a' style='padding: 0px 40px'><li>The actual rent that you pay is less than 10% of your basic salary</li><li>For metro cities, the HRA should be 50% of the basic salary, and for non-metro cities, it should be 40% of the basic salary</li><li>The actual HRA amount that you receive from your employer</li></ol><br /><li>Now, the least of the three situations above will be considered by the income tax, and accordingly, you will be rewarded with the tax benefit</li></ul><br />Using the HRA exemption calculator, you can have an insight into the tax benefit that you will get.</div>"
            },
            {
                "title": "<div>Am I eligible to receive HRA if I live with my parents?</div>",
                "content": "<div>Housing Rent Allowance, as the name suggests, is for people who live in a rented house. But as mentioned, it is a component of your salary. So, what about people who live in their parent's house? Will they receive HRA? The simple answer is yes.<br /><br />Let's understand with an example. Suppose, Sumity is living with her parents in Pathankot. Her salary includes HRA as a component. So, to use this HRA, she needs to make a rental agreement with her parents and provide the documents for the same in her company. The company will consider it as a regular rental agreement. The HRA received by Sumity must be transferred to her parent's account every month. Also, Sumity's parents need to show this rental income as their monthly income for income tax. If their income is taxable, this rent amount will also be taxable.</div>"
            },
            {
                "title": "<div>Documents required to claim tax deductions on HRA</div>",
                "content": "<div>To make a tax claim, you need to present a few documents. See the list below-<br /><br /><ul style='padding: 0px 30px'><li>Rent receipts</li><li>PAN of the house owner</li><li>If there is no PAN, the owner needs to provide a self-declaration for the same.</li></ul><br />You may be asked to provide other documents if required.</div>"
            },
            {
                "title": "<div>Can I claim a tax deduction if I don't receive an HRA?</div>",
                "content": "<div>HRA tax deduction is also available for people who do not receive HRA as a part of their salary. For this, the individual has to show the proof of rent that he is paying to the land owner. HRA tax deduction for such individuals is provided under Section 80(GG) of income tax.</div>"
            },
            {
                "title": "<div>Who is eligible to claim a tax deduction on HRA?</div>",
                "content": "<div>Any individual who is living in a rented house/parent's house can claim a tax deduction under income tax.</div>"
            },
            {
                "title": "<div>What is an HRA calculator?</div>",
                "content": "<div>HRA calculator is a digital tool that lets you calculate the tax deduction you are liable for. Enter details as asked, and it will show the expected tax deduction under income tax.</div>"
            },
            {
                "title": "<div>How does the HRA calculator work?</div>",
                "content": "<div>HRA calculator asks for a few inputs like your basic salary, city of residence, HRA, email, etc., and automatically calculates the income tax benefit you are eligible to receive. It is also calculated based on your income tax slab.</div>"
            },
            {
                "title": "<div>How do you use the HRA calculator?</div>",
                "content": "<div>On the website, click on the HRA calculator. Enter the details and submit to receive the result.</div>"
            },
            {
                "title": "<div>How to calculate HRA?</div>",
                "content": "<div>The HRA calculation formula is quite basic for employees. Here's how you can calculate-<br /><br /><ul style='padding: 0px 30px'><li>Metro city residents- 50% of their basic salary</li><li>Non-metro residents- 40% of their basic salary</li></ul><br />For instance, if you live in a metro city and your basic salary is ₹50,000/ month, then the HRA will be-<br /><br />50% of ₹50,000 = ₹25,000/ per month.</div>"
            },
            {
                "title": "<div>What are the benefits of the HRA calculator?</div>",
                "content": "<div>Several benefits you get to enjoy with the HRA calculator are-<br /><br /><ul style='padding: 0px 30px'><li>Automatic calculation</li><li>Save time and effort</li><li>Easy-To-Use digital tool</li><li>Accuracy in result</li></ul></div>"
            },
            {
                "title": "<div>If I have family living in two houses, can I claim HRA for both houses?</div>",
                "content": "<div>No. You can claim HRA only for one rental house.</div>"
            }
        ]
    },
    "gratuity-calculator": {
        "calculator_info": {
        "calculator_id": "fc416f60-94c0-47c8-8501-6843284791de",
        "url": "gratuity-calculator",
        "name": "Gratuity Calculator",
        "description": "Gratuity is a means of social security that's tied to your service to a particular organization. Before considering that job switch, you can use this calculator to work out exactly how much you're eligible for.",
        "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/gratutiy-calculator/icon.png",
        "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/gratutiy-calculator/icon.png",
        "related_calculators": []
    },
        "input_fields": [
            {
                "name": "salary component",
                "input_id": "ec79a42f-fdbc-47b9-b72d-437bc7e24e7b",
                "type": "slider_and_input",
                "label": "Monthly salary basic component",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>This is usually about 40-50% of your total salary, for the exact amount, check your latest salary slip",
                "min_value": {
                    "label": "10000",
                    "value": 10000
                },
                "max_value": {
                    "label": "10L",
                    "value": 1000000
                },
                "step_value": 1000,
                "value": 25000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "current company tenure",
                "input_id": "cb2f6a8b-c266-4c00-9a5e-dde484992cd9",
                "type": "slider_and_input",
                "label": "Tenure in current company",
                "prefix_text": "",
                "suffix_text": " years",
                "more_info": "<div>The number of years you've been working at the company you're currently employed at</div>",
                "min_value": {
                    "label": "5",
                    "value": 5
                },
                "max_value": {
                    "label": "50",
                    "value": 50
                },
                "step_value": 1,
                "value": 5,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            }
        ],
        "banner_details": {
            "title": "Get rewards better than Gratuity",
            "title_color": "#ffffff",
            "button_text": "Try the Fi Salary Program",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Gratuity-desktop-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Gratuity-desktop-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/gratuity-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/gratuity-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div><a href='/blog/posts/what-is-gratuity-in-salary' style='color: #00B899'>Gratuity</a> is a super straight concept - it's a way of rewarding you for staying in a company for 5 years or more. If you're someone working a corporate job, you probably know that 5 years is a long, long time and you better have good reason to stay in a job that long. Gratuity could be one of those good reasons.<br /><br />The calculation here is also pretty straightforward. And here's the formula we're using:<br />G = T x B x 15/26<br /><br />Where,<br />G is the gratuity amount that you're eligible for<br />T is the tenure in the company<br />B is your last salary (Basic + Dearness Allowance)<br /><br />Now, since the gratuity calculation thinks in terms of years, any period over 6 months is rounded off to the next year. Say you've worked 4 years and 8 months, you should count that as 5 years. Also good to know that a maximum of ₹20 lakh is exempt from tax.</div>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What is gratuity? Who is eligible to receive gratuity?</div>",
                "content": "<div>In every type of firm, the employees expect a reward in return for providing the services to the firm. The Government of India realises the hard work of each and every employee, which is why under the Payment of Gratuity Act 1972, employees are rewarded gratuity. Apart from the <a href='/blog/posts/salary-structure-components-how-to-calculate-your-salary' style='color: #00B899'>salary</a> that one receives, the company and firms offer this reward in the form of gratuity. In layman's language, gratuity in employment means thanksgiving when an employee retires.<br /><br />This 'thanksgiving' is offered in the monetary form by the company to the employee for providing honest services to the firm. For gratuity, the institution does not demand any contribution from the employees. The employer solely pays it. With that, it is possible for you to calculate your gratuity using the gratuity calculator.<br /><br />Now, who is eligible for gratuity?<br /><br /><ul style='padding: 0px 30px'><li>Any individual working in a firm that has more than ten employees is liable to pay its employees the gratuity amount</li><li>One must have completed a minimum of 5 years in service in order to receive the gratuity</li></ul></div>"
            },
            {
                "title": "<div>What is a gratuity calculator?</div>",
                "content": "<div>Are you wondering how to calculate the gratuity amount? Well, we'll do that for you with our gratuity calculator. This gratuity calculator is a simple-to-use online digital tool that helps you quickly calculate the gratuity that you will be eligible to receive.<br /><br />The gratuity calculator gives you an accurate result by providing a few details like monthly salary (Basic Salary + Dearness Allowance) and years of service.</div>"
            },
            {
                "title": "<div>What are the benefits of a gratuity calculator?</div>",
                "content": "<div>How can you benefit from a gratuity calculator? Is this what you are wondering about? If yes, the pointers below will give you a sneak peek into the various benefits of a gratuity calculator in India.<br /><br /><ul style='padding: 0px 30px'><li>You get an approximate idea of the gratuity you will be rewarded</li><li>The idea of the ascertained gratuity amount gives you the power to have a rough <a href='/blog/posts/what-is-a-financial-plan-and-how-can-i-make-one' style='color: #00B899'>financial plan</a> you wish to accomplish in future</li><li>You save a lot of time and effort when you use a gratuity calculator</li><li>You do not have to stress on calculation because that's what the gratuity calculator India does for you</li><li>With a few clicks and from the comfort of your home, you can easily know the details of your gratuity</li></ul></div>"
            },
            {
                "title": "<div>How is gratuity calculated?</div>",
                "content": "<div>There is a gratuity calculation formula that every firm follows in order to calculate the gratuity provided to their employees. It is also essential to note down that the gratuity calculation formula for retiring employees and those who pass away during the employment tenure are a bit different. Here's how it is calculated-<br /><br />G = T x B x 15/26<br />Where:<br />G is the gratuity amount that you're eligible for<br />T is the tenure in the company<br />B is your last salary (Basic + Dearness Allowance)<br />15/26 is the 15 wage days of the employee out of 26 days of the month</div>"
            },
            {
                "title": "<div>How is gratuity calculated in India for the private sector?</div>",
                "content": "<div>Government and private sector employees are eligible to receive the gratuity if the firm they work in has more than ten employees. If you are working in a private firm, don't worry; you can also calculate your gratuity in the gratuity calculator. Let's see the gratuity calculation formula for private-sector employees-</div><br /><div style='font-size: 30px;font-weight: 700;width: 150px; margin: 0px auto;'>A*B*15/26</div><br /><ul style='padding: 0px 30px'><li>A = the number of years of service</li><li>B = the last salary received (Basic Salary + Dearness allowance)</li><li><15 is the 15 days wages of the employee out of 26 days of the month/li></ul><br /><div>How to Calculate gratuity in case an employee passes away?</div><br /><style>.container {width: 268px; border-radius: 8px; overflow:hidden; border:1px solid #E7E7E7; margin: 0px auto;} @media (min-width: 768px){.container {width: 640px; border-radius: 25px;}} @media (min-width: 1290px){.container {width: 1010px;}} .table {width: 100%; border-collapse: collapse;} .tableHeadRow {background-color: #E7E7E7;} .tableHeadData {font-weight: 700; font-size: 12px; line-height: 155%; color:#494949; padding: 12px; text-align: left;} @media (min-width: 768px){.tableHeadData {font-size: 14px; line-height: 130%; padding: 20px;}} @media (min-width: 1290px){.tableHeadData {font-size: 20px; line-height: 130%; padding: 30px;}} .tableBodyRow {border-bottom: 1px solid #E7E7E7;} .tableBodyData {font-weight: 500; font-size: 12px; line-height: 155%; color:#494949; padding: 12px;} @media (min-width: 768px){.tableBodyData {font-size: 14px; line-height: 130%; padding: 20px;}} @media (min-width: 1290px){.tableBodyData {font-size: 20px; line-height: 130%; padding: 30px;}}</style><div class='container'><table class='table'><thead><tr class='tableHeadRow'><th class='tableHeadData tableHeadFirstChild'>Years of service</th><th class='tableHeadData tableHeadSecondChild'>Gratuity Rate</th></tr></thead><tbody><tr class='tableBodyRow'><td class='tableBodyData'>Less than one year</td><td class='tableBodyData'>2 X the basic pay</td></tr><tr class='tableBodyRow'><td class='tableBodyData'>1-5 years</td><td class='tableBodyData'>6</td></tr><tr class='tableBodyRow'><td class='tableBodyData'>5-11 years</td><td class='tableBodyData'>12</td></tr><tr class='tableBodyRow'><td class='tableBodyData'>11-20 years</td><td class='tableBodyData'>20</td></tr><tr><td class='tableBodyData'>20 years and more</td><td class='tableBodyData'>Half of salary for every six months completed after 20 years and a maximum of 33 times of the salary</td></tr></tbody></table></div><br /><span font-weight: 700;>Note:</span> If you complete 6 months or less, it will be rounded off to the lower value. If it exceeds 6 months, the year of service will be rounded off to the larger value."
            },
            {
                "title": "<div>How does the employer arrange gratuity?</div>",
                "content": "<div>In the case of gratuity, the employees are not asked to contribute. So, when an individual retires, the gratuity is solely paid from the employer's end. There are two ways in which the employer arranges the gratuity-<br /><br /><ul style='padding: 0px 30px'><li>The employer directly pays the gratuity to the employees from their end</li><li>The employer arranges for a general gratuity plan <a href='/blog/posts/what-are-important-insurance-terms' style='color: #00B899'>insurance</a>. Here, the company provides the premium to the general gratuity provider. In return, the insurance company provides gratuity to the employee after they retire</li></ul></div>"
            },
            {
                "title": "<div>Is there any tax on gratuity?</div>",
                "content": "<div>The million-dollar question we all want to know. There is a tax imposed on gratuity received but NOT for the government employees (don't tell your parents!). So, if you are employed in a government sector, relax; you need not pay any tax on the gratuity. Check out the taxation rules for various gratuity conditions under which the employees have to pay tax:<br /><br /><ul style='padding: 0px 30px'><li>If your firm's gratuity is covered under the Gratuity Act, the last 15 days' salary withdrawn by you remains non-taxable. Other than this, the remaining amount is taxable</li><li>If your firm provides you with gratuity which is not covered under Gratuity Act, then the following three conditions are exempted from tax-<br /><ul style='list-style-type:circle; padding: 0px 40px'><li>₹10,00,000</li><li>The gratuity amount received by the employee</li><li>Half a month's salary of each of the month that the employee has completed</li></ul></li></ul></div>"
            },
            {
                "title": "<div>What is meant by a gratuity calculator?</div>",
                "content": "<div>A gratuity calculator is a digital tool where employees can calculate their gratuity based on the years of service and the basic salary (including DA) they receive.</div>"
            },
            {
                "title": "<div>What is the gratuity calculation formula?</div>",
                "content": "<div>The gratuity calculation formula is quite simple and basic. It is - N*B*15/26. Here,<br />N is the number of years of service<br />B is the basic salary, including DA<br />15/26 is the 15 days salary out of 26 days of a month.</div>"
            },
            {
                "title": "<div>How does a gratuity calculator work?</div>",
                "content": "<div>A gratuity calculator in India is designed to automatically calculate the result based on the gratuity calculation formula. It calculates the gratuity by providing two details- years of service and the basic salary.</div>"
            },
            {
                "title": "<div>What are the advantages of using the Fi Money gratuity calculator?</div>",
                "content": "<div>There are several advantages of using the Fi Money gratuity calculator, like-<br /><br /><ul style='padding: 0px 30px'><li>It is 100% free to use</li><li>Fi Money gratuity calculator is simple and easy to use</li><li>You save time invested in calculating manually</li><li>Get results with a few clicks</li><li>Calculate your gratuity by sitting in your comfort zone</li></ul></div>"
            }
        ]
    },
    "epf-calculator": {
        "calculator_info": {
            "calculator_id": "7d17774a-6b28-42c9-9995-587863f24073",
            "url": "epf-calculator",
            "name": "EPF Calculator",
            "description": "The EPF is an initiative that assures every working professional has some part of their income saved for the future. Use this calculator to see how much your contributions will be worth at the time of your retirement.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/epf-calculator/icon.png",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/epf-calculator/icon.png",
            "related_calculators": []
        },
        "input_fields": [
            {
                "name": "your age",
                "input_id": "5b1ed889-92b3-4aeb-8e7c-2dd5b0105a25",
                "type": "slider_and_input",
                "label": "Your age",
                "prefix_text": "",
                "suffix_text": " years",
                "more_info": "<div>Your employer is supposed to contribute to your Provident Fund until the age of 58. This helps us work out how many years of contributions you have left",
                "min_value": {
                    "label": "15",
                    "value": 15
                },
                "max_value": {
                    "label": "59",
                    "value": 59
                },
                "step_value": 1,
                "value": 15,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "retirement age",
                "input_id": "527c035b-0157-4eac-be3e-34d0a7f15919",
                "type": "slider_and_input",
                "label": "Retirement age",
                "prefix_text": "",
                "suffix_text": " years",
                "more_info": "<div>Enter the age at which you wish to stop working. The latest is 58, after which you're no longer eligible for the Employee Pension Scheme</div>",
                "min_value": {
                    "label": "16",
                    "value": 16
                },
                "max_value": {
                    "label": "60",
                    "value": 60
                },
                "step_value": 1,
                "value": 60,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "monthly salary",
                "input_id": "ecef03d0-0be9-4b0d-ae70-e007cf0fccb1",
                "type": "slider_and_input",
                "label": "Basic component of monthly salary",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>You should be able to find this in your latest salary slip</div>",
                "min_value": {
                    "label": "500",
                    "value": 500
                },
                "max_value": {
                    "label": "1.5L",
                    "value": 150000
                },
                "step_value": 1000,
                "value": 10000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "current epf balance",
                "input_id": "d6be6f8d-1d6b-43df-8e94-f25b25016710",
                "type": "slider_and_input",
                "label": "Current EPF Balance",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>You can check it on the EPF portal. Or simply do a Google Search for 'EPF Member Passbook' and then login with your UAN</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "10CR",
                    "value": 100000000
                },
                "step_value": 1000,
                "value": 0,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "salary growth",
                "input_id": "cac3940d-c277-4a0c-955d-286a0729252b",
                "type": "slider_and_input",
                "label": "Your expected yearly salary growth",
                "prefix_text": "",
                "suffix_text": "%",
                "more_info": "<div>An approximate percentage by which your income is expected to grow year on year</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "20",
                    "value": 20
                },
                "step_value": 1,
                "value": 0,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "expected return",
                "input_id": "57766ee0-d049-4cd2-af04-3cedc8ca43e7",
                "type": "input",
                "label": "Expected Return",
                "prefix_text": "",
                "suffix_text": "%",
                "more_info": "<div>This is decided by the EPFO</div>",
                "min_value": {
                    "label": "",
                    "value": 8.1
                },
                "max_value": {
                    "label": "",
                    "value": 8.1
                },
                "step_value": 0,
                "value": 8.1,
                "readable_only": true,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            }
        ],
        "banner_details": {
            "title": "Working hard? Get rewarded for it",
            "title_color": "#ffffff",
            "button_text": "Try the Fi Salary Program",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Salary-desktop-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Salary-desktop-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Salary-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Salary-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>The provident fund, or <a href='/blog/posts/what-is-pf-in-salary-and-how-is-it-useful-to-employees' style='color: #00B899'>PF</a> as it's commonly called, is a corpus that's accessible to you upon retirement. This corpus is built both by contributions from you and your employer over your entire career. You can use this calculator to work out how much money you will have at your disposal<br /><br /><ol style='padding: 0px 30px'><li><b>Your age:</b> This is used to calculate how many years you have left until retirement, or in other words, the total tenure of your investment</li><li><b>Your retirement age:</b> This is capped at 58, but you can voluntarily retire earlier than that. This number minus your age right now gives us the <a href='/blog/categories/investments' style='color: #00B899'>investment</a> tenure.</li><li><b>Basic component of your salary:</b> This along with your 'Dearness Allowance' helps us work out the percentage of it that goes towards your PF corpus.</li><li><b>Current PF balance:</b> This is used as your starting balance and helps us accurately calculate your final EPF corpus.</li><li><b>Expected salary growth:</b> Your monthly PF contribution increases as your salary increases.</li><li>Expected returns on your PF is fixed at 8.1% per annum currently. This rate is reset every year by the government and has ranged between 8.1% and 8.8% over the last decade.</li></ol><br />You can use this calculator to estimate the amount you'd be left with at the end of your career.</div>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What is an EPF?</div>",
                "content": "<div>Most of us who are part of the salaried class, are probably working in private companies and earning some decent money compared to government jobs most Indians yearn for. To help salaried employees working in these private organisations get retirement benefits, the Employees Provident Fund Organisation (EPFO) introduced the <a href='/blog/posts/what-is-the-employees-provident-fund-epf-and-how-does-it-work' style='color: #00B899; word-break: break-word'>Employee Provident Fund</a> scheme. Any organization or firm with 20 or more employees gets this benefit. Employees who fall under the EPF scheme, make a fixed contribution of their basic salary and dearness allowance. Simultaneously, the employer also makes an equal contribution to the scheme. At the time of retirement, the employee can take out a lump sum, which includes the contributions of both employee and employer with the interest payments.<br /><br />Employees under this scheme contribute 12%* of their basic salary and dearness allowance and the employer also contributes 12%*. After consulting with the Ministry of Finance, the EPFO Board of Trustees fixed the interest at 8.1% for FY2022*.<br /><br />In the case of employers, 12% is contributed which only a small part goes to the EPF account. Out of the 12%, 8.33% goes towards <a href='/blog/posts/eps-what-is-employee-pension-scheme-how-to-check-if-you-are-a-part-of-eps' style='color: #00B899'>Employee Pension Scheme</a> Account, and the balance of 3.67% is parked in the employee EPF account.</div>"
            },
            {
                "title": "<div>What are the benefits of EPF?</div>",
                "content": "<div>Apart from helping you save for retirement, the EPF comes with several additional benefits<br /><br /><ul style='padding: 0px 30px'><li>You have the option to invest more than the standard 12% of your basic salary and dearness allowance if you wish to increase your corpus at the time of retirement. This extra amount will be saved under the heading of the Voluntary Provident Fund (VPF).</li><li>You get life insurance cover under the EPF.</li><li>EPF is completely tax-free at all stages. Up to ₹1.5L, every year is exempt under 80C, any interest you earn through EPF is also tax-free for a contribution amount less than 2.5L per annum. Finally, no tax on PF if you complete a minimum of 5 years of employment overall.</li><li>You can nominate your family members as a nominee who can get the financial benefit of your corpus in case of your untimely demise.</li><li>You have the option of withdrawing the amount early in case of an emergency under certain defined circumstances like job loss, loan repayment etc.</li></ul></div>"
            },
            {
                "title": "<div>How can I check my PF balance online?</div>",
                "content": "<div>If you have past employment experience where EPF has been deducted from your salary, then you already have some money stashed up in your PF account. You can then check your current PF online using these simple steps:<br /><br /><div>Step 1: Visit the government EPF website</div><div>Step 2: Choose the location of your PF office (State, regional branch office)</div><div>Step 3: Fill out the application form provided with your personal details and your EPF number shown on your payslip.</div><div>Step 4: Submit the application after cross-verifying</div><div>Step 5: If all your details are intact, then you will receive an SMS on your registered mobile with the latest balance.</div></div>"
            },
            {
                "title": "<div>How can an EPF calculator help you?</div>",
                "content": "<div>An EPF calculator is a pretty handy tool if you're looking to calculate an estimate of your savings. It's only normal to be worried about how much you can save in the future, so this EPF interest calculator is here to help give you as realistic a view as possible.<br /><br />Here are some benefits we've chalked down of using the EPF calculator online.<br /><br /><ol style='padding: 0px 30px' type='a'><li>The math is done for you</li><li>You don't need to worry about the interest rates changing all the time. The EPF calculator will automatically get updated.</li><li>The Fi.Money EPF calculator will give you as accurate a figure as possible. It also lets you assume a salary growth rate so your corpus amount is calculated more accurately.</li><li>The EPF calculator will automatically inform you if there is any change in interest rates  whenever you come back here to check.</li></ol></div>"
            },
            {
                "title": "<div>What is the formula to determine the EPF amount?</div>",
                "content": "<div>Okay, if you're still keen on learning how to calculate EPF manually, then here are a few things you need to know to calculate<br /><br /><ol style='padding: 0px 30px'><li>Basic salary + Dearness Allowance (DA)</li><li>Your contribution to EPF</li><li>Your employer's contribution to EPF</li><li>Your retirement age</li><li>Your current EPF balance</li><li>The current EPF interest rate</li></ol><br />Let's take an example to give you a better understanding of how to calculate EPF without a calculator.<br /><br /><ol style='padding: 0px 30px'><li>Employee's basic salary + dearness allowance = ₹10,000</li><li>Employees contribution towards the EPF = 12% * 10,000 = ₹1,200</li><li>Employers contribution towards the EPF = 3.67% * 10,000 = ₹367</li><li>Employers contribution towards EPS = 8.33% * 10,000 = ₹833.</li><li>The total contribution by the employer and employee towards the EPF account of the employee = ₹1,200 + ₹367 = ₹1,567.</li></ol><br />The interest rate is 8.1% for FY 2022-23.<br /><br />So the interest rate applicable monthly is 8.1%/12 = 0.675%<br /><br />Assuming the employee joined the company in April 2019, the total EPF contribution for April will be ₹1,567. The EPF scheme will not pay any interest for April.<br /><br />The total EPF contribution for the month of May = ₹3,134 (₹1,567+ ₹1,567). The employee receives an interest of ₹3,134 *0.675% = ₹21.15.<br /><br />The calculation is done for the subsequent months in a similar manner.</div>"
            },
            {
                "title": "<div>What are the benefits of Fi.Money EPF calculator?</div>",
                "content": "<div>Here are some benefits we've chalked down of using the EPF calculator online.<br /><br /><ol style='padding: 0px 30px' type='a'><li>The math is done for you</li><li>You can use the EPF interest calculator to calculate the corpus amount at different retirement ages.</li><li>You don't need to worry about the interest rates changing all the time. The EPF calculator will automatically get updated.</li><li>You can use the Fi.Money EPF calculator to plan any extra contributions you wish to make</li><li>The Fi.Money EPF calculator will give you as accurate a figure as possible.</li><li>The EPF calculator will automatically inform you if there is any change in regulations whenever you come back here to check.</li></ol></div>"
            },
            {
                "title": "<div>Is the EPF calculator free to use?</div>",
                "content": "<div>Absolutely! You can come back to the calculator anytime you want and you are free to experiment with the EPF calculator using any amounts, your contribution to the EPF and the age you wish to retire to see all possible outcomes.</div>"
            },
            {
                "title": "<div>Can I use the same EPF calculator even after I change my job?</div>",
                "content": "<div>Yes,  just enter the last PF balance when you left the previous job, and also enter the new basic salary to get an accurate estimate of PF corpus after your switch jobs.</div>"
            },
            {
                "title": "<div>Does the Fi.Money EPF calculator help monitor my EPF returns?</div>",
                "content": "<div>Not exactly. The EPF calculator only helps you determine the amount of money you will have at the time of your retirement. In case you feel that the amount is on the lower side after using the EPF calculator, you can start contributing more from now on to increase your corpus.</div>"
            },
            {
                "title": "<div>Does the EPF calculator get updated if the interest rate changes?</div>",
                "content": "<div>Yes! The best part about using the Fi.Money EPF interest calculator is that you don't need to worry about the interest rate. The calculator is designed in such a way that any new regulations and changes in rates will be automatically adjusted in the EPF calculator which will be visible to you at the time of calculating. It's all about plug and play.</div>"
            }
        ]
    },
    "cagr-calculator": {
        "calculator_info": {
            "calculator_id": "8d28761b-0c3b-4d9f-a4c8-a5291a197a53",
            "url": "cagr-calculator",
            "name": "CAGR Calculator",
            "description": "A CAGR calculator helps you determine the compounded annual growth rate of an investment over a specified time period. With this, you can calculate the average return on investment and make comparisons.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/gratutiy-calculator/icon.png",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/gratutiy-calculator/icon.png",
            "related_calculators": []
    },
        "input_fields": [
            {
                "name": "initial value",
                "input_id": "2f8f111f-30da-4d97-bc8a-aacc0b575f3e",
                "type": "input",
                "label": "Initial Value",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>Enter the amount you originally invested</div>",
                "min_value": {
                    "label": "₹1",
                    "value": 1
                },
                "max_value": {
                    "label": "₹1Cr",
                    "value": 10000000
                },
                "step_value": 1000,
                "value": 1000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "final value",
                "input_id": "890c3dc7-eeca-473c-a2bb-7f523ec3a75d",
                "type": "input",
                "label": "Final Value",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>Enter the expected final value of the investment, or the amount that you want it to become</div>",
                "min_value": {
                    "label": "₹1",
                    "value": 1
                },
                "max_value": {
                    "label": "₹10Cr",
                    "value": 100000000
                },
                "step_value": 1000,
                "value": 5000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "time period",
                "input_id": "dccc05e1-b46b-477a-af34-43b58b7defc0",
                "type": "slider_and_input",
                "label": "Time Period",
                "prefix_text": "",
                "suffix_text": " years",
                "more_info": "<div>The number of years you are investing for</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "30",
                    "value": 30
                },
                "step_value": 1,
                "value": "5",
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            }
        ],
        "banner_details": {
            "title": "Working hard? Get rewarded for it",
            "title_color": "#000000",
            "button_text": "Invest in Mutual Funds on Fi",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/CAGR-desktop-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/CAGR-desktop-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/CAGR-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/CAGR-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<p>The Fi Money online CAGR calculator uses the following information to tell you the returns you&rsquo;re making on your <a href='/blog/categories/investments' style='color: #00B899'>investment</a>.</p><ol style='padding: 0px 30px'><li><p>Initial value: This is the value of the investment at the beginning of the investment period.</p></li><li><p>Final value: This is the expected value at the end of the period, or the actual value in case you&rsquo;re trying to work out the CAGR for an existing investment.</p></li><li><p>The number of years the investment was held: This is the length of time over which the investment was held.</p></li></ style='padding: 0px 30px'><p>This CAGR calculator uses the following formula to calculate the compound annual growth rate:</p><p><br></p><p>CAGR = (Final Value / Initial Value)^(1 / Number of Years) - 1</p><p><br></p><p>The caret (^) symbol is used here to represent exponentiation. That means it indicates that a number is being raised to the power of whatever is on the right of the ^ symbol.</p>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What is meant by a CAGR calculator?</div>",
                "content": "<div>CAGR stands for compound annual growth rate. It measures the annualised rate of return on an investment over a certain period of time. A CAGR calculator is a tool that allows you to determine the CAGR of an investment over a specified period of time.</div>"
            },
            {
                "title": "<div>Why is CAGR important?</div>",
                "content": "<div><p>CAGR is important because it provides a standardised way to compare the performance of different investments over time. It takes into account the effect of compounded growth, which means that the <a href='/blog/posts/what-is-roi-how-to-calculate-return-on-investment' style='color: #00B899; word-break: break-word'>returns on an investment</a> are reinvested and earn additional returns in the future.</p><p><br></p><p>In other words, the gains you make on the investment are added to the original principal investment.</p><p><br></p><p>This can make a significant difference in the long-term growth potential of an investment.</p><p>For example, let&rsquo;s say you have two investments with the same initial value and the same final value after a certain number of years. However, one investment has a higher CAGR than the other. This means that the investment with the higher CAGR had a higher average annual return over the time period in question, which resulted in a greater overall increase in value.</p><p><br></p><p>By comparing the CAGR of different investments, you can get a better sense of which ones may be more suitable for your investment goals. For example, if you are looking for long-term growth, you may want to choose investments with a higher CAGR. On the other hand, if you are more concerned with preserving capital, you may want to choose investments with a lower CAGR but with a lower risk profile.</p></div>"
            },
            {
                "title": "<div>Is the CAGR Calculator free?</div>",
                "content": "<div>Yes, the Fi Money CAGR Calculator is completely free to use (& share!)</div>"
            },
            {
                "title": "<div>What is CAGR return?</div>",
                "content": "<div><p>CAGR return is the compound annual growth rate of an investment over a certain period of time. It is calculated as the annualized rate of return that would be required to grow an investment from its initial value to its final value over the specified period of time.</p><p><br></p><p>Take a look at this table, where we compare two investments of ₹10,000 at different CAGRs - one at 12%, and the other at 35%, with the investments held for 10 years.</p></div><br /><style>.container {width: 268px; border-radius: 8px; overflow:hidden; border:1px solid #E7E7E7; margin: 0px auto;} @media (min-width: 768px){.container {width: 640px; border-radius: 25px;}} @media (min-width: 1290px){.container {width: 1010px;}} .table {width: 100%; border-collapse: collapse;} .tableHeadRow {background-color: #E7E7E7;} .tableHeadData {font-weight: 700; font-size: 12px; line-height: 155%; color:#494949; padding: 12px; text-align: left;} @media (min-width: 768px){.tableHeadData {font-size: 14px; line-height: 130%; padding: 20px;}} @media (min-width: 1290px){.tableHeadData {font-size: 20px; line-height: 130%; padding: 30px;}} .tableBodyRow {border-bottom: 1px solid #E7E7E7;} .tableBodyData {font-weight: 500; font-size: 12px; line-height: 155%; color:#494949; padding: 12px;} @media (min-width: 768px){.tableBodyData {font-size: 14px; line-height: 130%; padding: 20px;}} @media (min-width: 1290px){.tableBodyData {font-size: 20px; line-height: 130%; padding: 30px;}}</style><div class='container'><table class='table'><thead><tr class='tableHeadRow'><th class='tableHeadData tableHeadFirstChild'>Initial Investment</th><th class='tableHeadData tableHeadSecondChild'>CAGR</th><th class='tableHeadData tableHeadSecondChild'>Final Amount</th></tr></thead><tbody><tr class='tableBodyRow'><td class='tableBodyData'>₹10,000</td><td class='tableBodyData'>12%</td><td class='tableBodyData'>₹31,058</td></tr><tr class='tableBodyRow'><td class='tableBodyData'>₹10,000</td><td class='tableBodyData'>35%</td><td class='tableBodyData'>₹2,01,066</td></tr></tbody></table></div><br />CAGR return is a useful measure of the long-term growth potential of an investment, and it can be helpful for comparing the performance of different investments. However, it is important to keep in mind that CAGR does not take into account the effects of volatility or changes in market conditions, so it may not accurately reflect the actual return of an investment in all cases."
            },
            {
                "title": "<div>Does the CAGR Calculator reflect investment risks?</div>",
                "content": "<div><p>CAGR does not take into account the effects of investment <a href='/blog/posts/what-are-the-risks-involved-in-mutual-funds' style='color: #00B899'>risks</a> such as volatility or changes in market conditions. As a result, it may not accurately reflect an investment&apos;s actual return in all cases.</p><p><br></p><p>For example, consider two investments with the same initial value and the same final value after a certain number of years. However, one investment has a higher CAGR than the other. This does not necessarily mean that the investment with the higher CAGR is a better investment, as it could be more risky or more volatile than the other investment.</p><p><br></p><p>To get a more accurate assessment of the risk and potential return of an investment, it is important to consider other factors such as the level of volatility, the potential for loss, and the overall market conditions.</p></div>"
            }
        ]
    },
    "inflation-calculator": {
        "calculator_info": {
            "calculator_id": "7e7463ea-0b97-48ed-9d22-ee1e8d572da5",
            "url": "inflation-calculator",
            "name": "Inflation Calculator",
            "description": "Worried about inflation affecting your savings and budget? Use this calculator to see its impact and plan for it.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/gratutiy-calculator/icon.png",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/gratutiy-calculator/icon.png",
            "related_calculators": []
    },
        "input_fields": [
            {
                "name": "current cost",
                "input_id": "64e6f153-1567-4e07-beb4-4daa572c1c5f",
                "type": "input",
                "label": "Current Cost",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>Enter the amount you’re spending on something right now. It could be your monthly expenses, or the cost of a specific item</div>",
                "min_value": {
                    "label": "₹100",
                    "value": 100
                },
                "max_value": {
                    "label": "₹10L",
                    "value": 1000000
                },
                "step_value": 1,
                "value": 100,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                
                "name": "view on inflation",
                "input_id": "596c8f45-5a4e-4de5-ba48-9b683309cb1c",
                "type": "slider",
                "label": "View on Inflation",
                "prefix_text": "",
                "suffix_text": "",
                "more_info": "<div>Use the slider to express how optimistic you’re feeling about inflation. </div>",
                "min_value": {
                    "label": "Very Low",
                    "value": -2
                },
                "max_value": {
                    "label": "Very High",
                    "value": 2
                },
                "step_value": 1,
                "value": 0,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null,
                "input_mapping": {
                    "-2": {
                        "label": "Very Low"
                    },
                    "-1": {
                        "label": "Low"
                    },
                    "0": {
                        "label": "Neutral"
                    },
                    "1": {
                        "label": "High"
                    },
                    "2": {
                        "label": "Very High"
                    }
                }
            },
            {
                "name": "time period",
                "input_id": "64db62d7-3644-4284-bb82-958900cf2e9e",
                "type": "slider_and_input",
                "label": "Time Period",
                "prefix_text": "",
                "suffix_text": " years",
                "more_info": "<div>The number of years over which you’re expecting this cost to inflate</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "30",
                    "value": 30
                },
                "step_value": 1,
                "value": "5",
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "assumed inflation rate",
                "input_id": "57766ee0-d049-4cd2-af04-3cedc8ca43e7",
                "type": "input",
                "label": "Assumed Inflation Rate (in %)",
                "prefix_text": "",
                "suffix_text": "%",
                "more_info": "<div>This is the rate of inflation we will use to calculate the change in your cost. You won’t be able to alter this.</div>",
                "min_value": {
                    "label": "",
                    "value": 1
                },
                "max_value": {
                    "label": "",
                    "value": 100
                },
                "step_value": 0,
                "value": 3.54,
                "readable_only": true,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            }
        ],
        "banner_details": {
            "title": "Stay on top of your expenses",
            "title_color": "#000000",
            "side_banner": "right",
            "button_text": "TRACK with FI",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Inflation-desktop-side-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Inflation-desktop-side-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/inflation-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/inflation-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<p>The Fi Money inflation calculator is a tool that allows you to see how the purchasing power has changed over time due to <a href='/blog/posts/the-rising-cost-of-living-how-inflation-is-impacting-household-budgets' style='color: #00B899'>inflation</a>. Purchasing power here refers to the amount of goods or services that your money can buy you today. It could be a litre of milk or a movie ticket. These costs go up with inflation every year.</p><p><br></p><p>This inflation calculator takes into account the amount of money you&rsquo;re looking to benchmark inflation against. For instance, you can enter your current monthly expenses and see how it compares to costs 3 years from now. Next, you&rsquo;ll need to enter the starting year and ending year.&nbsp;</p><p><br></p><p>The Fi Money <a href='/calculators' style='color: #00B899'>calculator</a> uses data on the rate of inflation to work out the purchasing power of your money in the future. The data is sourced from various reports that have documented the inflation rate year on year.&nbsp;</p><p><br></p><p>Note that this calculator does not attempt to predict inflation, but is just a projection based on past trends. Take it with a grain of salt, and plan your <a href='/blog/posts/ask-fi-search-tool' style='color: #00B899'>finances</a> accordingly. Remember, it&rsquo;s always better to err on the safer side.</p>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What is inflation?</div>",
                "content": "<div><p>Inflation is the periodic rise in costs of goods and services in any economy. It erodes your purchasing power, meaning that you get less for your money with each passing year.&nbsp;</p><p><br></p><p>It is the economic equivalent of a party guest who just won&apos;t leave. But don&apos;t worry, there are ways to fight back against inflation, like investing in assets that tend to increase in value over time.&nbsp;</p></div>"
            },
            {
                "title": "<div>How to calculate inflation?</div>",
                "content": "<div><p>The most common method to calculate inflation in India is by using the CPI or the consumer price index. This is provided by the NSO, or the National Statistical Office in India.</p><p><br></p><p>To calculate the inflation rate using the CPI, use the following checklist:&nbsp;</p><ul style='padding: 0px 30px'><li><p>Select a base year for the calculation. This is the year for which the inflation rate will be calculated.</p></li><li><p>Determine the inflation rate as a percentage. This is usually provided by the government every year. There are many other bureaus that also compile this information which you can aggregate.&nbsp;</p></li></ul></div>"
            },
            {
                "title": "<div>What is the formula for calculating inflation?</div>",
                "content": "<div><p>You can use the following formula to calculate inflation:</p><p><br></p><p>Price change = (Price in current year - Price in base year) / Price in base year x Inflation rate</p><p><br></p><p>Here&apos;s an example of how to use this formula:</p><p>Suppose you want to calculate the price change between 2022 and 2023, at an inflation rate of 6.31%. The price of a basket of goods and services was ₹100 in 2022, and it is ₹110 in 2023. The price change would be calculated as follows:</p><p><br></p><p>Price change = (110 - 100) / 100 x 6.31 = ₹6.31</p></div>"
            },
            {
                "title": "<div>How does inflation affect savings?</div>",
                "content": "<div><p>When it comes to savings, inflation is really Enemy Number One.</p><p>It can have a significant impact on savings because it reduces the purchasing power of money over time. This means, the same amount of money will be able to buy fewer and fewer things.&nbsp;</p><p><br></p><p>For example, let&rsquo;s suppose you have ₹10,000 saved in an FD that is earning a 6% interest rate, and the inflation rate is 7.41%. After one year, your ₹10,000 will have increased to ₹10,600 due to the interest earned.&nbsp;</p><p><br></p><p>However, the purchasing power of that money will have decreased by 7.41% due to inflation, so it will only be able to buy ₹9,259 worth of goods and services in today&apos;s prices.<br><br></p><p>Your cumulative gain is: (interest earned) - (purchasing power erosion due to inflation)</p><p>₹741 - ₹600 = -₹141</p><p>In this case, you&rsquo;ve actually lost ₹141&nbsp;</p><p>In other words, your initial investment of ₹10,000 is now worth ₹9,859</p><p><br></p><p>To maintain the purchasing power of your savings, you may need to invest in assets that give you inflation-beating returns.&nbsp;</p></div>"
            },
            {
                "title": "<div>How can an inflation calculator help you?</div>",
                "content": "<div><p>The Fi Money inflation calculator can be used to calculate the projected cost of goods over a period of time. This in turn should help you plan your savings because it gives you an indication of how much your money should be growing to meet these costs in the future.</p><p><br></p><p>Let&rsquo;s say you current lifestyle costs you ₹25,000 per month. This cost goes up to ₹28,300 in 5 years. This is a 13.2% increase. This means, you should invest in assets that give you at least 13.2% returns (over 5 years), if not more.</p></div>"
            }
        ]
    },
    "fire-calculator": {
        "calculator_info": {
            "calculator_id": "6097e0f1-a80f-4c0a-b9c8-a0766c8db3a6",
            "url": "fire-calculator",
            "name": "FIRE Calculator",
            "description": "FIRE stands for ‘Financial Independence, Retire Early’. It’s a lifestyle movement that’s become popular around the world, which aims at cutting down on expenses and building a corpus to achieve financial freedom. Use this calculator to work out how many years of financial freedom you have, at the current rate that you’re saving money.",
            "mobile_top_sheet_description": "Find out how early you can retire",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/rocking-chair.webp",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/rocking-chair.png",
            "mobile_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/rocking-chair-mobile.webp",
            "fallback_mobile_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/rocking-chair-mobile.png",
            "mobile_poster_label": "Try it out",
            "related_calculators": []
        },
        "input_fields": [
            {
                "input_id": "69f2ab59-4f3b-4708-9255-1f9aa715003d",
                "type": "text_label_with_icon",
                "text": "Financial independence goal",
                "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/financial-independence-goal.webp",
                "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/financial-independence-goal.png"
            },
            {
                "name": "Current age and Retire Age",
                "first_input_label": "Current age",
                "second_input_label": "Retire age",
                "input_id": "57dd6b3c-76ea-49e6-8d0a-4dbc419294ff",
                "type": "multi_range_slider",
                "label": "How old are you now and when do you want to retire?",
                "prefix_text": "",
                "suffix_text": " Years",
                "more_info": "<div>This will help us understand when you can start investing</div>",
                "min_value": {
                    "label": "15 yrs",
                    "value": 15
                },
                "max_value": {
                    "label": "59 yrs",
                    "value": 59
                },
                "step_value": 1,
                "value": {
                    "valueOne": 30,
                    "valueTwo": 45
                },
                "readable_only": true,
                "allow_decimal": false,
                "debounce_time": 500,
                "min_gap_between_two_inputs": 1,
                "options": [],
                "has_cta": [{"label": "next", "offsetIndex": 0, "style": {"width": "85px"}}]
            },
            {
                "input_id": "67f86ce5-7195-48cd-bbc2-dc7194ba3538",
                "type": "text_label_with_icon",
                "text": "Income calculation",
                "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/income-calculation.webp",
                "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/income-calculation.png"
            },
            {
                "name": "Monthly salary",
                "input_id": "af08336a-52c0-48f0-8dc7-bd438d27d988",
                "type": "slider_and_input",
                "label": "Current monthly total salary",
                "prefix_text": "₹",
                "suffix_text": " /mo",
                "more_info": "<div>This is the number quoted on your salary slip, not what you receive in the bank</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "1 CR",
                    "value": 10000000
                },
                "step_value": 1000,
                "value": 190000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [],
                "has_cta": [{"label": "next", "offsetIndex": 1, "style": {"width": "85px"}}]
            },
            {
                "name": "Salary hike",
                "input_id": "e418708b-6a52-4ab5-9f3b-39cc1d40488e",
                "type": "slider_and_input",
                "label": "Expected annual salary hike",
                "prefix_text": "",
                "suffix_text": " %",
                "more_info": "<div>You can assume a number that seems like a reasonable average hike in your industry. For example, software engineers can expect 20% every year</div>",
                "min_value": {
                    "label": "0%",
                    "value": 0
                },
                "max_value": {
                    "label": "20%",
                    "value": 20
                },
                "step_value": 1,
                "value": 10,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [],
                "has_cta": [{"label": "next", "offsetIndex": 2, "style": {"width": "85px"}}]
            },
            {
                "name": "Monthly expenses",
                "input_id": "ee463fe1-7719-4a98-a50b-294941f1cea2",
                "type": "slider_and_input",
                "label": "Current monthly expenses",
                "prefix_text": "₹",
                "suffix_text": " /mo",
                "more_info": "<div>Total up only the important monthly expenses like rent, fuel, bills etc</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "1 CR",
                    "value": 10000000
                },
                "step_value": 1000,
                "value": 60000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [],
                "has_cta": [{"label": "next", "offsetIndex": 3, "style": {"width": "85px"}}]
            },
            {
                "input_id": "ecd563b8-da03-46bf-b135-5eba877a2614",
                "type": "text_label_with_icon",
                "text": "Lifestyle expenses calculation",
                "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/lifestyle-upgrade-calculation.webp",
                "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/lifestyle-upgrade-calculation.png"
            },
            {
                "name": "Expense hike",
                "input_id": "feb12f28-50c1-4dcf-87c8-0f61b3611891",
                "type": "slider_and_input",
                "label": "By the time you’re 40, how much more do you think you will be spending each month? ",
                "prefix_text": "",
                "suffix_text": " times",
                "more_info": "<div>By how much will your lifestyle expenses increase. If you think your expenses will double, then choose 2x, and so on</div>",
                "min_value": {
                    "label": "1",
                    "value": 1
                },
                "max_value": {
                    "label": "3",
                    "value": 3
                },
                "step_value": 0.25,
                "value": 1,
                "readable_only": true,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": [],
                "has_cta": [{"label": "I'm not sure", "offsetIndex": 4, "style": {"width": "130px", "background-color": "#ECEEF0", "color" : "#00B899"}}, {"label": "next", "offsetIndex": 5, "style": {"width": "85px"}}]
            },
            {
                "input_id": "8375c4c3-87c3-4a4e-beef-230f773d5b8d",
                "type": "accordion",
                "accordion_label": "Not Sure how Much",
                "label": "Lifestyle upgrade estimate",
                "prefix_text": "",
                "suffix_text": "",
                "more_info": "",
                "value": 0,
                "has_cta": [{"label": "next", "offsetIndex": 5, "style": {"width": "85px"}}],
                "nested_items": [
                    {
                        "name": "Lifestyle upgrade multiplier option-1",
                        "input_id": "75366000-be53-4d5f-b05e-30cb8ae02e8d",
                        "type": "checkbox",
                        "label": "<style>@media (max-width: 767px) {.checkbox-label {font-size: 14px; font-weight: 600; text-align: start; width: 200px; line-height: 18px;}}</style><div class='checkbox-label'>Do you intend to live in a bigger house or a more expensive locality than today?</div>",
                        "prefix_text": "",
                        "suffix_text": "",
                        "more_info": "",
                        "min_value": null,
                        "max_value": null,
                        "step_value": 0,
                        "value": {
                            "is_checked": false,
                            "value": 0
                        },
                        "checked_value": 0.25,
                        "unchecked_value": 0,
                        "readable_only": false,
                        "allow_decimal": false,
                        "debounce_time": 500,
                        "has_nested_item": true,
                        "parent_item_index": 8
                    },
                    {
                        "name": "Lifestyle upgrade multiplier option-2",
                        "input_id": "95574ed1-fae9-4c7c-a323-b37c9f2224cc",
                        "type": "checkbox",
                        "label": "<div class='checkbox-label'>Do you think your expenses will go up due to childrens education and lifestyle?</div>",
                        "prefix_text": "",
                        "suffix_text": "",
                        "more_info": "",
                        "min_value": null,
                        "max_value": null,
                        "step_value": 0,
                        "value": {
                            "is_checked": false,
                            "value": 0
                        },
                        "checked_value": 0.5,
                        "unchecked_value": 0,
                        "readable_only": false,
                        "allow_decimal": false,
                        "debounce_time": 500,
                        "has_nested_item": true,
                        "parent_item_index": 8
                    },
                    {
                        "name": "Lifestyle upgrade multiplier option-3",
                        "input_id": "a841025b-a244-445d-8938-ee73d147292e",
                        "type": "checkbox",
                        "label": "<div class='checkbox-label'>Do you think your expenses will go up due to parents depending on you?</div>",
                        "prefix_text": "",
                        "suffix_text": "",
                        "more_info": "",
                        "min_value": null,
                        "max_value": null,
                        "step_value": 0,
                        "value": {
                            "is_checked": false,
                            "value": 0
                        },
                        "checked_value": 0.5,
                        "unchecked_value": 0,
                        "readable_only": false,
                        "allow_decimal": false,
                        "debounce_time": 500,
                        "has_nested_item": true,
                        "parent_item_index": 8
                    },
                    {
                        "name": "Lifestyle upgrade multiplier option-4",
                        "input_id": "8bdac6a2-8e12-4be6-956f-7027a502dbfd",
                        "type": "checkbox",
                        "label": "<div class='checkbox-label'>Are you someone who changes your phone and car every year?</div>",
                        "prefix_text": "",
                        "suffix_text": "",
                        "more_info": "",
                        "min_value": null,
                        "max_value": null,
                        "step_value": 0,
                        "value": {
                            "is_checked": false,
                            "value": 0
                        },
                        "checked_value": 0.25,
                        "unchecked_value": 0,
                        "readable_only": false,
                        "allow_decimal": false,
                        "debounce_time": 500,
                        "has_nested_item": true,
                        "parent_item_index": 8
                    },
                    {
                        "name": "Lifestyle upgrade multiplier option-5",
                        "input_id": "7134e1d8-ff17-43f7-902a-06ee40d18cc2",
                        "type": "checkbox",
                        "label": "<div class='checkbox-label'>After retirement, will you be making one international trip every year?</div>",
                        "prefix_text": "",
                        "suffix_text": "",
                        "more_info": "",
                        "min_value": null,
                        "max_value": null,
                        "step_value": 0,
                        "value": {
                            "is_checked": false,
                            "value": 0
                        },
                        "checked_value": 0.25,
                        "unchecked_value": 0,
                        "readable_only": false,
                        "allow_decimal": false,
                        "debounce_time": 500,
                        "has_nested_item": true,
                        "parent_item_index": 8
                    },
                    {
                        "name": "Lifestyle upgrade multiplier option-6",
                        "input_id": "530e953f-6f42-4b1f-8958-92b17dbe3fd2",
                        "type": "checkbox",
                        "label": "<div class='checkbox-label'>Is your family covered by medical and life insurance other than what your company gives you?</div>",
                        "prefix_text": "",
                        "suffix_text": "",
                        "more_info": "",
                        "min_value": null,
                        "max_value": null,
                        "step_value": 0,
                        "value": {
                            "is_checked": false,
                            "value": 0
                        },
                        "checked_value": 0.25,
                        "unchecked_value": 0,
                        "readable_only": false,
                        "allow_decimal": false,
                        "debounce_time": 500,
                        "has_nested_item": true,
                        "parent_item_index": 8
                    },
                    {
                        "name": "Expense at",
                        "input_id": "3a9ad9d7-f285-4a63-8464-7ba3b5f6288e",
                        "type": "input",
                        "label": "Expense at 40",
                        "prefix_text": "",
                        "suffix_text": " times",
                        "more_info": "",
                        "min_value": null,
                        "max_value": null,
                        "step_value": 0,
                        "value": 0,
                        "readable_only": true,
                        "allow_decimal": true,
                        "debounce_time": 500,
                        "options": [],
                        "has_nested_item": true,
                        "is_input_inside_another_component": true,
                        "parent_item_index": 8
                    }
                ]
            },
            {
                "input_id": "f1c1e09e-bd6f-42f8-8e19-646293423482",
                "type": "text_label_with_icon",
                "text": "How do you invest?",
                "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/investment-calculation.webp",
                "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/fire-calculator/investment-calculation.png"
            },
            {
                "name": "Pf balance",
                "input_id": "9579581e-1093-4afc-a771-542513a11ad4",
                "type": "slider_and_input",
                "label": "What’s your PF Total?",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>This will help us extrapolate from  your current long term savings</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "1 CR",
                    "value": 10000000
                },
                "step_value": 1000,
                "value": 1200000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [],
                "has_cta": [{"label": "next", "offsetIndex": 6, "style": {"width": "85px"}}]
            },
            {
                "name": "Current corpus expf",
                "input_id": "29178ba5-332a-4bc4-8a50-f3d480764689",
                "type": "slider_and_input",
                "label": "Your total portfolio value (not including your PF)",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>This will help us extrapolate from  your current long term investments</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "1 CR",
                    "value": 10000000
                },
                "step_value": 1000,
                "value": 1200000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [],
                "has_cta": [{"label": "next", "offsetIndex": 7, "style": {"width": "85px"}}]
            },
            {
                "name": "Monthly contribution",
                "input_id": "bacadb22-12f9-45e9-b4e8-e3319abeedd8",
                "type": "slider_and_input",
                "label": "How much do you invest or save every month? (not including your PF)",
                "prefix_text": "₹",
                "suffix_text": "",
                "more_info": "<div>This will help us determine your investment run-rate</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "1 CR",
                    "value": 10000000
                },
                "step_value": 1000,
                "value": 50000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [],
                "has_cta": [{"label": "next", "offsetIndex": 8, "style": {"width": "85px"}}]
            },
            {
                "name": "Risk Profile",
                "input_id": "bb73d7ef-f460-4c8a-bbbc-584595c0f221",
                "type": "dropdown",
                "label": "How would you define your risk appetite",
                "prefix_text": "",
                "suffix_text": "",
                "more_info": "<div>We'll use this to project your non PF investment corpus as per rates of return mentioned below:<br /><br />Aggressively: 12% long term returns, you're comfortable with more risk<br /><br />Moderately: 9% long term returns, moderate risk<br /><br />Conservatively: 6% long term returns, very low risk</div>",
                "min_value": null,
                "max_value": null,
                "step_value": 0,
                "value": {
                    "label": "Aggressive",
                    "value": 12,
                    "id": 1
                },
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": [
                    {
                        "label": "Aggressive",
                        "value": 12,
                        "id": 1
                    },
                    {
                        "label": "Moderate",
                        "value": 9,
                        "id": 2
                    },
                    {
                        "label": "Conservative",
                        "value": 6,
                        "id": 3
                    }
                ],
                "has_cta": [{"label": "submit", "offsetIndex": 9, "style": {"width": "85px"}}]
            },
            {
                "name": "Sip growth rate",
                "input_id": "e0551662-0b6b-4a23-b6b2-a47df52af052",
                "type": "slider_and_input",
                "label": "Try stepping up your SIP",
                "show_bottom_of_graph": true,
                "prefix_text": "",
                "suffix_text": " %",
                "more_info": "<div>Increase this to see how your financial independence is impacted by stepping up your SIPs annually</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "15%",
                    "value": 15
                },
                "step_value": 1,
                "value": 15,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": [],
                "is_input_inside_another_component": true
            }
        ],
        "banner_details": {},
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>Before we jump into the calculation methodology, let’s try and understand financial independence - think of it as a state of your finances wherein your monthly expenses necessary for you to live a satisfactory life, are organically financed from the investment corpus you’ve built. Meaning that your monthly living costs are covered by your investments (or any other passive income) and not by your monthly salary.<br /><br />In this calculator, we attempt to model the number of years you can achieve financial independence based on your current spending and investing behaviour.<br /><br />We break up the calculation into two parts:<br /><br /><b>1. The accumulation phase - </b> This is the period where you’ll be working and saving up for your financial independence goal. It is the time between today and the age you choose as your financial independence age. During this phase we’re performing the following calculations:<ul style='padding: 0px 30px'><li>Project your current expenses to a future date by accounting for an increase in spends due to inflation.</li><li>We also try to understand any increase in expenses due to lifestyle changes (such as bigger car, bigger house etc.)  and life stage events (kids, dependants etc.) and increase your expenses by a suitable factor.</li><li>The choice to define these expenses is up to you, but be aware that higher expenses (i.e. a more expensive lifestyle) is a tradeoff you’re making with the duration of financial independence you can achieve.</li><li>We then calculate how much your current investments would amount to at your targeted age.</li></ul><br /><b>2. The spending phase -</b> During this period we simulate your financial independence. Based on how much you’ve accumulated from investing, we determine how many years your money would last before you run out of your reserves<ul style='padding: 0px 30px'><li>We assume that you want this hard earned corpus to be in safe assets, therefore during the spending phase we invest your accumulated corpus in a debt fund that returns at least the long term average rate of inflation i.e. 6%.</li><li>Every month we withdraw only your monthly expense from this corpus while the rest of it continues to earn a rate of return that matches inflation.</li><li>The withdrawal amount is based on the expense projection calculation we’ve done in the previous section.</li><li>Even during your spending phase, the withdrawal amount goes up every year due to inflation.</li></ul><br /><b>3. Tweaking the output - </b>While the fundamental construct of the calculator is to tell you how much financial independence you can plan for based on your current investment and spending behavior, we also want you to take control of the situation by tweaking some input variables to improve your outcome. Following is how you can do this:<ul style='padding: 0px 30px'><li>If you feel the years of independence is too low then you could very well try to push your target age by a couple of years to see how this improves your final outcome</li><li>Another variable you can tweak is your investment/SIP growth rate. Let's say you’re investing ₹20,000 per month, you can systematically increase your SIP amount every year by a certain percentage to improve your final outcome. So if you choose a 10% growth rate, you’re committing to investing ₹22,000 p.m. next year, ₹24,200 p.m. the next year and ₹26,620 p.m. the following year and so on…</li></ul></div>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What is a FIRE calculator?</div>",
                "content": "<div>A FIRE calculator is essentially a retirement savings calculator.<br/>FIRE is an acronym for Financial Independence, Retire Early. It’s a sort of lifestyle movement that has seen popularity around the world, especially over the last decade. In India, the FIRE movement is relatively more recent. In the context of the FIRE movement, early retirement could mean anything between the age of 35-50, instead of the standard age of retirement of 60.<br /><br />This FIRE calculator helps you work out how early you can actually retire, based on inputs given by you. It takes into account your age right now, your income, and the rate at which your savings are growing, to tell you approximately at what age you could expect to retire.<br /><br />Even if you’re not planning to retire as early as prescribed by followers of the FIRE movement, this calculator could give you a general idea of where you stand in terms of your retirement readiness and what steps you could take to improve your chances of a relatively early retirement.</div>"
            },
            {
                "title": "<div>How can a FIRE calculator help you?</div>",
                "content": "<div>The FIRE calculator is simply a tool to help you visualise an early retirement from a financial perspective. Given the current economic climate, rate of population increase, inflation and other volatilities around the world, it’s pretty likely that Millennials and GenZs will only see retirement after the age of 70 instead of the current norm of 60.<br /><br />This FIRE calculator by Fi Money factors in your present income, savings, expenses and a few other parameters to give you a projection of when you’re likely to retire. Using this output, you can fine-tune your saving strategy either by increasing your risk or diversifying your wealth to suit your end goal - which is either an early retirement or a retirement supported by passive income.</div>"
            },
            {
                "title": "<div>What is the method to determine FIRE calculation?</div>",
                "content": "<div>The Fi Money FIRE calculator calculates your retirement age based on the following factors:<ol style='padding: 0px 30px'><li>Your age</li><li>Number of years left to retire</li><li>Your current income</li><li>Your current monthly expenses</li><li>Your monthly expense growth (how much more are you likely to spend each month as the years go by)</li><li>Your projected income growth (how much more you are likely to earn year on year)</li><li>Your current savings</li><li>Your savings growth (how much more than what you’re already saving will you save each year)</li><li>Your risk appetite (to determine how much your savings are likely to grow each year)</li></ol></div>"
            },
            {
                "title": "<div>Is FIRE calculator free to use?</div>",
                "content": "<div>Yes, this calculator is free to use (and share!) and requires no sign-in, membership, or any other personal information to be able to use this calculator. You can use this calculator not only to calculate your projected age of retirement, but also to generally plan your retirement based on your current income, savings, and risk appetite.</div>"
            }
        ]
    },
    "credit-card-interest-rate-calculator": {
        "calculator_info": {
            "calculator_id": "411d8448-f949-43fb-b328-cd275f3d17a2",
            "url": "credit-card-interest-rate-calculator",
            "name": "Credit Card Interest Rate Calculator",
            "description": "Planning to spend more than you can repay on your credit card? This calculator is the bearer of bad news. Calculate how much interest you're paying on your credit card bills if you don’t pay the whole amount.",
            "icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/credit-card-calculator/icon.webp",
            "fallback_icon_url": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/credit-card-calculator/icon.png",
            "related_calculators": []
        },
        "input_fields": [
            {
                "name": "Enter regular credit card expenses",
                "input_id": "c6333533-58cb-4f08-b57e-159d3aa96b91",
                "type": "slider_and_input",
                "label": "Enter regular credit card expenses",
                "prefix_text": "₹",
                "suffix_text": " /mo",
                "more_info": "<div>OTT subscriptions and any other expenses that you put on your credit card every month</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "1L",
                    "value": 100000
                },
                "step_value": 1000,
                "value": 50000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            },
            {
                "name": "How much of the bill will you pay",
                "input_id": "4c3b8501-be09-4246-87aa-11286099e8d5",
                "type": "slider_and_input",
                "label": "How much of the bill will you pay?",
                "prefix_text": "₹",
                "suffix_text": " /mo",
                "more_info": "<div>You can pay up the minimum amount, the whole amount, or even less than the minimum amount.</div>",
                "min_value": {
                    "label": "0",
                    "value": 0
                },
                "max_value": {
                    "label": "10L",
                    "value": 1000000
                },
                "step_value": 1000,
                "value": 10000,
                "readable_only": false,
                "allow_decimal": true,
                "debounce_time": 500,
                "options": null
            }
        ],
        "banner_details": {
            "title": "Rewards, everywhere, all at once",
            "title_color": "#ffffff",
            "side_banner": "left",
            "button_text": "Get Credit Card now",
            "url": "https://fi-money-test.onelink.me/PxeA/bgf7vin8",
            "desktop_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Credit-card-desktop-side-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/Credit-card-desktop-side-banner.png"
            },
            "mobile_image_src" : {
                "image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/credit-card-mobile-banner.webp",
                "fallback_image_src": "https://dza2kd7rioahk.cloudfront.net/assets/calculators/banners/credit-card-mobile-banner.png"
            }
        },
        "additional_information": [
            {
                "title": "<div>How it works</div>",
                "content": "<div>This Fi Money credit card interest rate calculator helps you calculate how much interest you will pay on your <a href='/blog/posts/understand-the-credit-card-balance-transfer-procedure' style='color: #00B899'>credit card balance</a> over a certain period of time, if you don’t pay the whole amount. You can use this calculator to see what happens if you pay just the minimum amount or any other amount that’s lesser than the whole amount due.<br /><br />Let’s say you plan on buying an iPhone, but do not plan on paying the whole amount due on your credit card at the end of that month. And let’s say you continue using your card every month thereafter. This calculator then tells you how much you’ll have to pay as interest at the end of a certain number of months, giving you a sense of your <a href='/blog/posts/how-to-calculate-personal-loan-repayments' style='color: #00B899'>repayment</a> duration.</div>"
            }
        ],
        "faqs_information": [
            {
                "title": "<div>What is a credit card interest rate calculator?</div>",
                "content": "<div>It is a tool that allows you to determine how much interest you will be charged on your credit card balance over a specific period of time. You need to input information such as your <a href='/blog/posts/credit-card-limit-meaning-explained-by-experts' style='color: #00B899'>credit limit</a>, the amount you plan to spend, and the amount you will (hypothetically) pay while clearing the bill at the end of the billing cycle. The calculator then uses this information to calculate the total interest that you will be charged. This can help you to budget or even compare a credit card with other instruments like a personal loan. You should be able to visualise this repayment duration in the form of the graph shown here.</div>"
            },
            {
                "title": "<div>How to use a credit card interest rate calculator?</div>",
                "content": "<div>This credit card <a href='/blog/posts/maximise-your-savings-how-to-utilise-the-interest-free-period-on-your-credit-card' style='color: #00B899'>interest</a> rate calculator from Fi Money uses the following inputs:<br /><br /><ol style='padding: 0px 30px'><li>Credit limit</li><li>How much you plan to spend: This could be a big expense you’re planning to put on your credit card</li><li>How much you wish to pay at the end of the month: This could be the minimum amount or any other amount other than the whole amount.</li></ol><br/>With this, the calculator will work out the total interest charges on the credit card.This is only an estimate, and the actual amount in interest will depend on your bank or will be specific to your card. Use this calculator only to get a general idea of how much extra you will end up paying in interest.</div>"
            },
            {
                "title": "<div>How can a credit card interest rate calculator help you save money?</div>",
                "content": "<div>Here are some broad use cases of a credit card interest rate calculator:<br /><br /><div><b>Budgeting</b></div><div>When you specify your credit limit, your upcoming expenses, and the amount you plan to pay at the end of the month, this calculator can show you the total interest charges you’ll have to pay at the end of a time period. This should help you decide your financing approach for any big purchase you have in mind.</div><br /><div><b>Balance repayment</b></div><div>By trying out different payment amounts, you should be able to see how they affect the total amount due at the end of a time period. This can help you do the math and see if this approach is feasible for you or not.</div><br /><div><b>Debt consolidation</b></div><div>You can compare the output given to you by this calculator with loan interest rates to see if you can take a debt consolidation approach. Debt consolidation is essentially the practice of taking a lower interest loan to pay off a higher interest loan, in effect reducing the overall debt you’re in.</br> You can read more about debt consolidation <a href='/blog/posts/how-personal-loans-can-help-with-debt-consolidation' style='color: #00B899;'>here.</a></div></div>"
            },
            {
                "title": "<div>Is it a good idea to only make minimum payments on my credit card to save on interest?</div>",
                "content": "<div>Absolutely not. Unless, of course, you have no other choice but to pay just the minimum amount each time. But otherwise, paying just the minimum amount is a sure-shot way to fall into debt trap. <a href='/blog/posts/what-are-credit-card-rewards-how-do-they-work' style='color: #00B899; word-break: break-word'>Credit card</a> companies leverage this option by letting you only pay the minimum amount due, and then charging you an Annual Percentage Rate (APR) that adds up every single day that your dues aren’t paid.</div>"
            },
            {
                "title": "<div>Is credit card interest rate calculator free to use?</div>",
                "content": "<div>Yes this credit card interest rate calculator is free to use (and share!). If you are, or if you know someone, planning to pay off just the minimum amount or any other amount other than the full amount due on the credit card, then this is a good tool to calculate how much you’ll actually pay. So, go ahead and share this calculator with the world!</div>"
            }
        ]
    },
    "points": {
        "calculator_info": {
            "calculator_id": "d433219c-2822-462b-8b22-f0e35bb20b90",
            "url": "points",
            "name": "CC Valueback Calculator",
            "description": "",
            "icon_url": "",
            "fallback_icon_url": "",
            "related_calculators": []
        },
        "input_fields": [
            {
                "name": "monthly spends",
                "input_id": "64e6f153-1567-4e07-beb4-4daa572c1c5f",
                "type": "slider_and_input",
                "label": "ON AVERAGE MONTHLY SPENDS OF",
                "prefix_text": "₹",
                "suffix_text": "",
                "min_value": {
                    "label": "₹15000",
                    "value": 15000
                },
                "max_value": {
                    "label": "₹60000",
                    "value": 60000
                },
                "step_value": 5000,
                "value": 35000,
                "readable_only": false,
                "allow_decimal": false,
                "debounce_time": 500,
                "options": null
            }
        ]
    }
}